espressif/esp-idf/components/soc/esp32h4/register/soc/twaifd_reg.h
/** TWAIFD_COMMAND_REG register
 *  TWAI FD command register
 */
#define TWAIFD_COMMAND_REG (DR_REG_TWAIFD_BASE + 0xc)
/** TWAIFD_RXRPMV : WO; bitpos: [1]; default: 0;
 *  RX Buffer read pointer move.
 */
#define TWAIFD_RXRPMV    (BIT(1))
#define TWAIFD_RXRPMV_M  (TWAIFD_RXRPMV_V << TWAIFD_RXRPMV_S)
#define TWAIFD_RXRPMV_V  0x00000001U
#define TWAIFD_RXRPMV_S  1
/** TWAIFD_RRB : WO; bitpos: [2]; default: 0;
 *  Release RX Buffer. This command flushes RX buffer and resets its memory pointers.
 *  0: invalid
 *  1: delete
 */
#define TWAIFD_RRB    (BIT(2))
#define TWAIFD_RRB_M  (TWAIFD_RRB_V << TWAIFD_RRB_S)
#define TWAIFD_RRB_V  0x00000001U
#define TWAIFD_RRB_S  2
/** TWAIFD_CDO : WO; bitpos: [3]; default: 0;
 *  Clear Data Overrun flag in RX buffer.
 *  0: invalid
 *  1: clear
 */
#define TWAIFD_CDO    (BIT(3))
#define TWAIFD_CDO_M  (TWAIFD_CDO_V << TWAIFD_CDO_S)
#define TWAIFD_CDO_V  0x00000001U
#define TWAIFD_CDO_S  3
/** TWAIFD_ERCRST : WO; bitpos: [4]; default: 0;
 *  Error Counters Reset. When unit is bus off, issuing this command will request
 *  erasing TEC, REC counters after
 *  128 consecutive occurrences of 11 recessive bits. Upon completion, TEC and REC are
 *  erased and fault confinement
 *  State is set to error-active. When unit is not bus-off, or when unit is bus-off due
 *  to being disabled (SETTINGS[ENA]
 *  = ’0’), this command has no effect.
 */
#define TWAIFD_ERCRST    (BIT(4))
#define TWAIFD_ERCRST_M  (TWAIFD_ERCRST_V << TWAIFD_ERCRST_S)
#define TWAIFD_ERCRST_V  0x00000001U
#define TWAIFD_ERCRST_S  4
/** TWAIFD_RXFCRST : WO; bitpos: [5]; default: 0;
 *  Clear RX bus traffic counter (RX_COUNTER register).
 */
#define TWAIFD_RXFCRST    (BIT(5))
#define TWAIFD_RXFCRST_M  (TWAIFD_RXFCRST_V << TWAIFD_RXFCRST_S)
#define TWAIFD_RXFCRST_V  0x00000001U
#define TWAIFD_RXFCRST_S  5
/** TWAIFD_TXFCRST : WO; bitpos: [6]; default: 0;
 *  Clear TX bus traffic counter (TX_COUNTER register).
 */
#define TWAIFD_TXFCRST    (BIT(6))
#define TWAIFD_TXFCRST_M  (TWAIFD_TXFCRST_V << TWAIFD_TXFCRST_S)
#define TWAIFD_TXFCRST_V  0x00000001U
#define TWAIFD_TXFCRST_S  6
/** TWAIFD_CPEXS : WO; bitpos: [7]; default: 0;
 *  Clear Protocol exception status (STATUS[PEXS]).
 */
#define TWAIFD_CPEXS    (BIT(7))
#define TWAIFD_CPEXS_M  (TWAIFD_CPEXS_V << TWAIFD_CPEXS_S)
#define TWAIFD_CPEXS_V  0x00000001U
#define TWAIFD_CPEXS_S  7
/** TWAIFD_CRXPE : WO; bitpos: [8]; default: 0;
 *  Clear STATUS[RXPE] flag.
 */
#define TWAIFD_CRXPE    (BIT(8))
#define TWAIFD_CRXPE_M  (TWAIFD_CRXPE_V << TWAIFD_CRXPE_S)
#define TWAIFD_CRXPE_V  0x00000001U
#define TWAIFD_CRXPE_S  8
/** TWAIFD_CTXPE : WO; bitpos: [9]; default: 0;
 *  Clear STATUS[TXPE] flag.
 */
#define TWAIFD_CTXPE    (BIT(9))
#define TWAIFD_CTXPE_M  (TWAIFD_CTXPE_V << TWAIFD_CTXPE_S)
#define TWAIFD_CTXPE_V  0x00000001U
#define TWAIFD_CTXPE_S  9
/** TWAIFD_CTXDPE : WO; bitpos: [10]; default: 0;
 *  Clear STATUS[TXDPE] flag.
 */
#define TWAIFD_CTXDPE    (BIT(10))
#define TWAIFD_CTXDPE_M  (TWAIFD_CTXDPE_V << TWAIFD_CTXDPE_S)
#define TWAIFD_CTXDPE_V  0x00000001U
#define TWAIFD_CTXDPE_S  10

/** TWAIFD_INT_STAT_REG register
 *  TWAI FD command register
 */
#define TWAIFD_INT_STAT_REG (DR_REG_TWAIFD_BASE + 0x10)
/** TWAIFD_RXI_INT_ST : R/W1C; bitpos: [0]; default: 0;
 *  The masked interrupt status of TWAIFD_RXI_INT.
 *  Frame received interrupt.
 */
#define TWAIFD_RXI_INT_ST    (BIT(0))
#define TWAIFD_RXI_INT_ST_M  (TWAIFD_RXI_INT_ST_V << TWAIFD_RXI_INT_ST_S)
#define TWAIFD_RXI_INT_ST_V  0x00000001U
#define TWAIFD_RXI_INT_ST_S  0
/** TWAIFD_TXI_INT_ST : R/W1C; bitpos: [1]; default: 0;
 *  The masked interrupt status of TWAIFD_TXI_INT.
 *  Frame transmitted interrupt.
 */
#define TWAIFD_TXI_INT_ST    (BIT(1))
#define TWAIFD_TXI_INT_ST_M  (TWAIFD_TXI_INT_ST_V << TWAIFD_TXI_INT_ST_S)
#define TWAIFD_TXI_INT_ST_V  0x00000001U
#define TWAIFD_TXI_INT_ST_S  1
/** TWAIFD_EWLI_INT_ST : R/W1C; bitpos: [2]; default: 0;
 *  The masked interrupt status of TWAIFD_EWLI_INT.
 *  Error warning limit interrupt. When both TEC and REC are lower than EWL and one of
 *  the becomes equal to or
 *  higher than EWL, or when both TEC and REC become less than EWL, this interrupt is
 *  generated. When Interrupt
 *  is cleared and REC, or TEC is still equal to or higher than EWL, Interrupt is not
 *  generated again.
 */
#define TWAIFD_EWLI_INT_ST    (BIT(2))
#define TWAIFD_EWLI_INT_ST_M  (TWAIFD_EWLI_INT_ST_V << TWAIFD_EWLI_INT_ST_S)
#define TWAIFD_EWLI_INT_ST_V  0x00000001U
#define TWAIFD_EWLI_INT_ST_S  2
/** TWAIFD_DOI_INT_ST : R/W1C; bitpos: [3]; default: 0;
 *  The masked interrupt status of TWAIFD_DOI_INT.
 *  Data overrun interrupt. Before this  Interrupt is cleared , STATUS[DOR] must be
 *  cleared to avoid setting of this
 *  Interrupt again.
 */
#define TWAIFD_DOI_INT_ST    (BIT(3))
#define TWAIFD_DOI_INT_ST_M  (TWAIFD_DOI_INT_ST_V << TWAIFD_DOI_INT_ST_S)
#define TWAIFD_DOI_INT_ST_V  0x00000001U
#define TWAIFD_DOI_INT_ST_S  3
/** TWAIFD_FCSI_INT_ST : R/W1C; bitpos: [4]; default: 0;
 *  The masked interrupt status of TWAIFD_FCSI_INT.
 *  Fault confinement state changed interrupt. Interrupt is set when node turns
 *  error-passive (from error-active),
 *  bus-off (from error-passive) or error-active (from bus-off after reintegration or
 *  from error-passive).
 */
#define TWAIFD_FCSI_INT_ST    (BIT(4))
#define TWAIFD_FCSI_INT_ST_M  (TWAIFD_FCSI_INT_ST_V << TWAIFD_FCSI_INT_ST_S)
#define TWAIFD_FCSI_INT_ST_V  0x00000001U
#define TWAIFD_FCSI_INT_ST_S  4
/** TWAIFD_ALI_INT_ST : R/W1C; bitpos: [5]; default: 0;
 *  The masked interrupt status of TWAIFD_ALI_INT.
 *  Arbitration lost interrupt.
 */
#define TWAIFD_ALI_INT_ST    (BIT(5))
#define TWAIFD_ALI_INT_ST_M  (TWAIFD_ALI_INT_ST_V << TWAIFD_ALI_INT_ST_S)
#define TWAIFD_ALI_INT_ST_V  0x00000001U
#define TWAIFD_ALI_INT_ST_S  5
/** TWAIFD_BEI_INT_ST : R/W1C; bitpos: [6]; default: 0;
 *  The masked interrupt status of TWAIFD_BEI_INT.
 *  Bus error interrupt.
 */
#define TWAIFD_BEI_INT_ST    (BIT(6))
#define TWAIFD_BEI_INT_ST_M  (TWAIFD_BEI_INT_ST_V << TWAIFD_BEI_INT_ST_S)
#define TWAIFD_BEI_INT_ST_V  0x00000001U
#define TWAIFD_BEI_INT_ST_S  6
/** TWAIFD_OFI_INT_ST : R/W1C; bitpos: [7]; default: 0;
 *  The masked interrupt status of TWAIFD_OFI_INT.
 *  Overload frame interrupt.
 */
#define TWAIFD_OFI_INT_ST    (BIT(7))
#define TWAIFD_OFI_INT_ST_M  (TWAIFD_OFI_INT_ST_V << TWAIFD_OFI_INT_ST_S)
#define TWAIFD_OFI_INT_ST_V  0x00000001U
#define TWAIFD_OFI_INT_ST_S  7
/** TWAIFD_RXFI_INT_ST : R/W1C; bitpos: [8]; default: 0;
 *  The masked interrupt status of TWAIFD_RXFI_INT.
 *  RX buffer full interrupt.
 */
#define TWAIFD_RXFI_INT_ST    (BIT(8))
#define TWAIFD_RXFI_INT_ST_M  (TWAIFD_RXFI_INT_ST_V << TWAIFD_RXFI_INT_ST_S)
#define TWAIFD_RXFI_INT_ST_V  0x00000001U
#define TWAIFD_RXFI_INT_ST_S  8
/** TWAIFD_BSI_INT_ST : R/W1C; bitpos: [9]; default: 0;
 *  The masked interrupt status of TWAIFD_BSI_INT.
 *  Bit rate shifted interrupt.
 */
#define TWAIFD_BSI_INT_ST    (BIT(9))
#define TWAIFD_BSI_INT_ST_M  (TWAIFD_BSI_INT_ST_V << TWAIFD_BSI_INT_ST_S)
#define TWAIFD_BSI_INT_ST_V  0x00000001U
#define TWAIFD_BSI_INT_ST_S  9
/** TWAIFD_RBNEI_INT_ST : R/W1C; bitpos: [10]; default: 0;
 *  The masked interrupt status of TWAIFD_RBNEI_INT.
 *  RX buffer not empty interrupt. Clearing this interrupt and not reading out content
 *  of RX Buffer via RX_DATA
 *  will re-activate the interrupt.
 */
#define TWAIFD_RBNEI_INT_ST    (BIT(10))
#define TWAIFD_RBNEI_INT_ST_M  (TWAIFD_RBNEI_INT_ST_V << TWAIFD_RBNEI_INT_ST_S)
#define TWAIFD_RBNEI_INT_ST_V  0x00000001U
#define TWAIFD_RBNEI_INT_ST_S  10
/** TWAIFD_TXBHCI_INT_ST : R/W1C; bitpos: [11]; default: 0;
 *  The masked interrupt status of TWAIFD_TXBHCI_INT.
 *  TXT buffer HW command interrupt. Anytime TXT buffer receives HW command from CAN
 *  Core which
 *  changes TXT buffer state to "TX OK", "Error" or "Aborted", this interrupt will be
 *  generated.
 */
#define TWAIFD_TXBHCI_INT_ST    (BIT(11))
#define TWAIFD_TXBHCI_INT_ST_M  (TWAIFD_TXBHCI_INT_ST_V << TWAIFD_TXBHCI_INT_ST_S)
#define TWAIFD_TXBHCI_INT_ST_V  0x00000001U
#define TWAIFD_TXBHCI_INT_ST_S  11

