espressif/esp-idf/components/soc/esp32h4/register/soc/twaifd_reg.h
/** TWAIFD_INT_MASK_SET_REG register
 *  TWAI FD interrupt mask register
 */
#define TWAIFD_INT_MASK_SET_REG (DR_REG_TWAIFD_BASE + 0x1c)
/** TWAIFD_RXI_INT_MASK_SET : R/W1S; bitpos: [0]; default: 0;
 *  Write 1 to mask TWAIFD_RXI_INT.
 */
#define TWAIFD_RXI_INT_MASK_SET    (BIT(0))
#define TWAIFD_RXI_INT_MASK_SET_M  (TWAIFD_RXI_INT_MASK_SET_V << TWAIFD_RXI_INT_MASK_SET_S)
#define TWAIFD_RXI_INT_MASK_SET_V  0x00000001U
#define TWAIFD_RXI_INT_MASK_SET_S  0
/** TWAIFD_TXI_INT_MASK_SET : R/W1S; bitpos: [1]; default: 0;
 *  Write 1 to mask TWAIFD_TXI_INT.
 */
#define TWAIFD_TXI_INT_MASK_SET    (BIT(1))
#define TWAIFD_TXI_INT_MASK_SET_M  (TWAIFD_TXI_INT_MASK_SET_V << TWAIFD_TXI_INT_MASK_SET_S)
#define TWAIFD_TXI_INT_MASK_SET_V  0x00000001U
#define TWAIFD_TXI_INT_MASK_SET_S  1
/** TWAIFD_EWLI_INT_MASK_SET : R/W1S; bitpos: [2]; default: 0;
 *  Write 1 to mask TWAIFD_EWLI_INT.
 */
#define TWAIFD_EWLI_INT_MASK_SET    (BIT(2))
#define TWAIFD_EWLI_INT_MASK_SET_M  (TWAIFD_EWLI_INT_MASK_SET_V << TWAIFD_EWLI_INT_MASK_SET_S)
#define TWAIFD_EWLI_INT_MASK_SET_V  0x00000001U
#define TWAIFD_EWLI_INT_MASK_SET_S  2
/** TWAIFD_DOI_INT_MASK_SET : R/W1S; bitpos: [3]; default: 0;
 *  Write 1 to mask TWAIFD_DOI_INT.
 */
#define TWAIFD_DOI_INT_MASK_SET    (BIT(3))
#define TWAIFD_DOI_INT_MASK_SET_M  (TWAIFD_DOI_INT_MASK_SET_V << TWAIFD_DOI_INT_MASK_SET_S)
#define TWAIFD_DOI_INT_MASK_SET_V  0x00000001U
#define TWAIFD_DOI_INT_MASK_SET_S  3
/** TWAIFD_FCSI_INT_MASK_SET : R/W1S; bitpos: [4]; default: 0;
 *  Write 1 to mask TWAIFD_FCSI_INT.
 */
#define TWAIFD_FCSI_INT_MASK_SET    (BIT(4))
#define TWAIFD_FCSI_INT_MASK_SET_M  (TWAIFD_FCSI_INT_MASK_SET_V << TWAIFD_FCSI_INT_MASK_SET_S)
#define TWAIFD_FCSI_INT_MASK_SET_V  0x00000001U
#define TWAIFD_FCSI_INT_MASK_SET_S  4
/** TWAIFD_ALI_INT_MASK_SET : R/W1S; bitpos: [5]; default: 0;
 *  Write 1 to mask TWAIFD_ALI_INT.
 */
#define TWAIFD_ALI_INT_MASK_SET    (BIT(5))
#define TWAIFD_ALI_INT_MASK_SET_M  (TWAIFD_ALI_INT_MASK_SET_V << TWAIFD_ALI_INT_MASK_SET_S)
#define TWAIFD_ALI_INT_MASK_SET_V  0x00000001U
#define TWAIFD_ALI_INT_MASK_SET_S  5
/** TWAIFD_BEI_INT_MASK_SET : R/W1S; bitpos: [6]; default: 0;
 *  Write 1 to mask TWAIFD_BEI_INT.
 */
#define TWAIFD_BEI_INT_MASK_SET    (BIT(6))
#define TWAIFD_BEI_INT_MASK_SET_M  (TWAIFD_BEI_INT_MASK_SET_V << TWAIFD_BEI_INT_MASK_SET_S)
#define TWAIFD_BEI_INT_MASK_SET_V  0x00000001U
#define TWAIFD_BEI_INT_MASK_SET_S  6
/** TWAIFD_OFI_INT_MASK_SET : R/W1S; bitpos: [7]; default: 0;
 *  Write 1 to mask TWAIFD_OFI_INT.
 */
#define TWAIFD_OFI_INT_MASK_SET    (BIT(7))
#define TWAIFD_OFI_INT_MASK_SET_M  (TWAIFD_OFI_INT_MASK_SET_V << TWAIFD_OFI_INT_MASK_SET_S)
#define TWAIFD_OFI_INT_MASK_SET_V  0x00000001U
#define TWAIFD_OFI_INT_MASK_SET_S  7
/** TWAIFD_RXFI_INT_MASK_SET : R/W1S; bitpos: [8]; default: 0;
 *  Write 1 to mask TWAIFD_RXFI_INT.
 */
#define TWAIFD_RXFI_INT_MASK_SET    (BIT(8))
#define TWAIFD_RXFI_INT_MASK_SET_M  (TWAIFD_RXFI_INT_MASK_SET_V << TWAIFD_RXFI_INT_MASK_SET_S)
#define TWAIFD_RXFI_INT_MASK_SET_V  0x00000001U
#define TWAIFD_RXFI_INT_MASK_SET_S  8
/** TWAIFD_BSI_INT_MASK_SET : R/W1S; bitpos: [9]; default: 0;
 *  Write 1 to mask TWAIFD_BSI_INT.
 */
#define TWAIFD_BSI_INT_MASK_SET    (BIT(9))
#define TWAIFD_BSI_INT_MASK_SET_M  (TWAIFD_BSI_INT_MASK_SET_V << TWAIFD_BSI_INT_MASK_SET_S)
#define TWAIFD_BSI_INT_MASK_SET_V  0x00000001U
#define TWAIFD_BSI_INT_MASK_SET_S  9
/** TWAIFD_RBNEI_INT_MASK_SET : R/W1S; bitpos: [10]; default: 0;
 *  Write 1 to mask TWAIFD_RBNEI_INT.
 */
#define TWAIFD_RBNEI_INT_MASK_SET    (BIT(10))
#define TWAIFD_RBNEI_INT_MASK_SET_M  (TWAIFD_RBNEI_INT_MASK_SET_V << TWAIFD_RBNEI_INT_MASK_SET_S)
#define TWAIFD_RBNEI_INT_MASK_SET_V  0x00000001U
#define TWAIFD_RBNEI_INT_MASK_SET_S  10
/** TWAIFD_TXBHCI_INT_MASK_SET : R/W1S; bitpos: [11]; default: 0;
 *  Write 1 to mask TWAIFD_TXBHCI_INT.
 */
#define TWAIFD_TXBHCI_INT_MASK_SET    (BIT(11))
#define TWAIFD_TXBHCI_INT_MASK_SET_M  (TWAIFD_TXBHCI_INT_MASK_SET_V << TWAIFD_TXBHCI_INT_MASK_SET_S)
#define TWAIFD_TXBHCI_INT_MASK_SET_V  0x00000001U
#define TWAIFD_TXBHCI_INT_MASK_SET_S  11

/** TWAIFD_INT_MASK_CLR_REG register
 *  TWAI FD interrupt mask clear register
 */
#define TWAIFD_INT_MASK_CLR_REG (DR_REG_TWAIFD_BASE + 0x20)
/** TWAIFD_RXI_INT_MASK_CLR : WO; bitpos: [0]; default: 0;
 *  Write 1 to clear TWAIFD_RXI_INT_MASK_CLR .
 */
#define TWAIFD_RXI_INT_MASK_CLR    (BIT(0))
#define TWAIFD_RXI_INT_MASK_CLR_M  (TWAIFD_RXI_INT_MASK_CLR_V << TWAIFD_RXI_INT_MASK_CLR_S)
#define TWAIFD_RXI_INT_MASK_CLR_V  0x00000001U
#define TWAIFD_RXI_INT_MASK_CLR_S  0
/** TWAIFD_TXI_INT_MASK_CLR : WO; bitpos: [1]; default: 0;
 *  Write 1 to clear TWAIFD_TXI_INT_MASK_CLR .
 */
#define TWAIFD_TXI_INT_MASK_CLR    (BIT(1))
#define TWAIFD_TXI_INT_MASK_CLR_M  (TWAIFD_TXI_INT_MASK_CLR_V << TWAIFD_TXI_INT_MASK_CLR_S)
#define TWAIFD_TXI_INT_MASK_CLR_V  0x00000001U
#define TWAIFD_TXI_INT_MASK_CLR_S  1
/** TWAIFD_EWLI_INT_MASK_CLR : WO; bitpos: [2]; default: 0;
 *  Write 1 to clear TWAIFD_EWLI_INT_MASK_CLR .
 */
#define TWAIFD_EWLI_INT_MASK_CLR    (BIT(2))
#define TWAIFD_EWLI_INT_MASK_CLR_M  (TWAIFD_EWLI_INT_MASK_CLR_V << TWAIFD_EWLI_INT_MASK_CLR_S)
#define TWAIFD_EWLI_INT_MASK_CLR_V  0x00000001U
#define TWAIFD_EWLI_INT_MASK_CLR_S  2
/** TWAIFD_DOI_INT_MASK_CLR : WO; bitpos: [3]; default: 0;
 *  Write 1 to clear TWAIFD_DOI_INT_MASK_CLR .
 */
#define TWAIFD_DOI_INT_MASK_CLR    (BIT(3))
#define TWAIFD_DOI_INT_MASK_CLR_M  (TWAIFD_DOI_INT_MASK_CLR_V << TWAIFD_DOI_INT_MASK_CLR_S)
#define TWAIFD_DOI_INT_MASK_CLR_V  0x00000001U
#define TWAIFD_DOI_INT_MASK_CLR_S  3
/** TWAIFD_FCSI_INT_MASK_CLR : WO; bitpos: [4]; default: 0;
 *  Write 1 to clear TWAIFD_FCSI_INT_MASK_CLR .
 */
#define TWAIFD_FCSI_INT_MASK_CLR    (BIT(4))
#define TWAIFD_FCSI_INT_MASK_CLR_M  (TWAIFD_FCSI_INT_MASK_CLR_V << TWAIFD_FCSI_INT_MASK_CLR_S)
#define TWAIFD_FCSI_INT_MASK_CLR_V  0x00000001U
#define TWAIFD_FCSI_INT_MASK_CLR_S  4
/** TWAIFD_ALI_INT_MASK_CLR : WO; bitpos: [5]; default: 0;
 *  Write 1 to clear TWAIFD_ALI_INT_MASK_CLR .
 */
#define TWAIFD_ALI_INT_MASK_CLR    (BIT(5))
#define TWAIFD_ALI_INT_MASK_CLR_M  (TWAIFD_ALI_INT_MASK_CLR_V << TWAIFD_ALI_INT_MASK_CLR_S)
#define TWAIFD_ALI_INT_MASK_CLR_V  0x00000001U
#define TWAIFD_ALI_INT_MASK_CLR_S  5
/** TWAIFD_BEI_INT_MASK_CLR : WO; bitpos: [6]; default: 0;
 *  Write 1 to clear TWAIFD_BEI_INT_MASK_CLR .
 */
#define TWAIFD_BEI_INT_MASK_CLR    (BIT(6))
#define TWAIFD_BEI_INT_MASK_CLR_M  (TWAIFD_BEI_INT_MASK_CLR_V << TWAIFD_BEI_INT_MASK_CLR_S)
#define TWAIFD_BEI_INT_MASK_CLR_V  0x00000001U
#define TWAIFD_BEI_INT_MASK_CLR_S  6
/** TWAIFD_OFI_INT_MASK_CLR : WO; bitpos: [7]; default: 0;
 *  Write 1 to clear TWAIFD_OFI_INT_MASK_CLR .
 */
#define TWAIFD_OFI_INT_MASK_CLR    (BIT(7))
#define TWAIFD_OFI_INT_MASK_CLR_M  (TWAIFD_OFI_INT_MASK_CLR_V << TWAIFD_OFI_INT_MASK_CLR_S)
#define TWAIFD_OFI_INT_MASK_CLR_V  0x00000001U
#define TWAIFD_OFI_INT_MASK_CLR_S  7
/** TWAIFD_RXFI_INT_MASK_CLR : WO; bitpos: [8]; default: 0;
 *  Write 1 to clear TWAIFD_RXFI_INT_MASK_CLR .
 */
#define TWAIFD_RXFI_INT_MASK_CLR    (BIT(8))
#define TWAIFD_RXFI_INT_MASK_CLR_M  (TWAIFD_RXFI_INT_MASK_CLR_V << TWAIFD_RXFI_INT_MASK_CLR_S)
#define TWAIFD_RXFI_INT_MASK_CLR_V  0x00000001U
#define TWAIFD_RXFI_INT_MASK_CLR_S  8
/** TWAIFD_BSI_INT_MASK_CLR : WO; bitpos: [9]; default: 0;
 *  Write 1 to clear TWAIFD_BSI_INT_MASK_CLR .
 */
#define TWAIFD_BSI_INT_MASK_CLR    (BIT(9))
#define TWAIFD_BSI_INT_MASK_CLR_M  (TWAIFD_BSI_INT_MASK_CLR_V << TWAIFD_BSI_INT_MASK_CLR_S)
#define TWAIFD_BSI_INT_MASK_CLR_V  0x00000001U
#define TWAIFD_BSI_INT_MASK_CLR_S  9
/** TWAIFD_RBNEI_INT_MASK_CLR : WO; bitpos: [10]; default: 0;
 *  Write 1 to clear TWAIFD_RBNEI_INT_MASK_CLR .
 */
#define TWAIFD_RBNEI_INT_MASK_CLR    (BIT(10))
#define TWAIFD_RBNEI_INT_MASK_CLR_M  (TWAIFD_RBNEI_INT_MASK_CLR_V << TWAIFD_RBNEI_INT_MASK_CLR_S)
#define TWAIFD_RBNEI_INT_MASK_CLR_V  0x00000001U
#define TWAIFD_RBNEI_INT_MASK_CLR_S  10
/** TWAIFD_TXBHCI_INT_MASK_CLR : WO; bitpos: [11]; default: 0;
 *  Write 1 to clear TWAIFD_TXBHCI_INT_MASK_CLR .
 */
#define TWAIFD_TXBHCI_INT_MASK_CLR    (BIT(11))
#define TWAIFD_TXBHCI_INT_MASK_CLR_M  (TWAIFD_TXBHCI_INT_MASK_CLR_V << TWAIFD_TXBHCI_INT_MASK_CLR_S)
#define TWAIFD_TXBHCI_INT_MASK_CLR_V  0x00000001U
#define TWAIFD_TXBHCI_INT_MASK_CLR_S  11

/** TWAIFD_BTR_REG register
 *  TWAI FD bit-timing  register
 */
#define TWAIFD_BTR_REG (DR_REG_TWAIFD_BASE + 0x24)
/** TWAIFD_PROP : R/W; bitpos: [6:0]; default: 5;
 *  Configures the propagation segment of nominal bit rate.
 *  Measurement unit: time quanta
 */
#define TWAIFD_PROP    0x0000007FU
#define TWAIFD_PROP_M  (TWAIFD_PROP_V << TWAIFD_PROP_S)
#define TWAIFD_PROP_V  0x0000007FU
#define TWAIFD_PROP_S  0
/** TWAIFD_PH1 : R/W; bitpos: [12:7]; default: 3;
 *  Configures the phase 1 segment of nominal bit rate.
 *  Measurement unit: time quanta
 */
#define TWAIFD_PH1    0x0000003FU
#define TWAIFD_PH1_M  (TWAIFD_PH1_V << TWAIFD_PH1_S)
#define TWAIFD_PH1_V  0x0000003FU
#define TWAIFD_PH1_S  7
/** TWAIFD_PH2 : R/W; bitpos: [18:13]; default: 5;
 *  Configures the phase 2 segment of nominal bit rate.
 *  Measurement unit: time quanta
 */
#define TWAIFD_PH2    0x0000003FU
#define TWAIFD_PH2_M  (TWAIFD_PH2_V << TWAIFD_PH2_S)
#define TWAIFD_PH2_V  0x0000003FU
#define TWAIFD_PH2_S  13
/** TWAIFD_BRP : R/W; bitpos: [26:19]; default: 10;
 *  Configures the baud-rate prescaler of nominal bit rate.
 *  Measurement unit: cycle of core clock.
 */
#define TWAIFD_BRP    0x000000FFU
#define TWAIFD_BRP_M  (TWAIFD_BRP_V << TWAIFD_BRP_S)
#define TWAIFD_BRP_V  0x000000FFU
#define TWAIFD_BRP_S  19
/** TWAIFD_SJW : R/W; bitpos: [31:27]; default: 2;
 *  Represents the synchronization jump width in nominal bit time.
 *  Measurement unit: time quanta
 */
#define TWAIFD_SJW    0x0000001FU
#define TWAIFD_SJW_M  (TWAIFD_SJW_V << TWAIFD_SJW_S)
#define TWAIFD_SJW_V  0x0000001FU
#define TWAIFD_SJW_S  27

/** TWAIFD_BTR_FD_REG register
 *  TWAI FD bit-timing of FD register
 */
#define TWAIFD_BTR_FD_REG (DR_REG_TWAIFD_BASE + 0x28)
/** TWAIFD_PROP_FD : R/W; bitpos: [5:0]; default: 3;
 *  Configures the propagation segment of data bit rate.
 *  Measurement unit: time quanta
 */
#define TWAIFD_PROP_FD    0x0000003FU
#define TWAIFD_PROP_FD_M  (TWAIFD_PROP_FD_V << TWAIFD_PROP_FD_S)
#define TWAIFD_PROP_FD_V  0x0000003FU
#define TWAIFD_PROP_FD_S  0
/** TWAIFD_PH1_FD : R/W; bitpos: [11:7]; default: 3;
 *  Configures the phase 1 segment of data bit rate.
 *  Measurement unit: time quanta
 */
#define TWAIFD_PH1_FD    0x0000001FU
#define TWAIFD_PH1_FD_M  (TWAIFD_PH1_FD_V << TWAIFD_PH1_FD_S)
#define TWAIFD_PH1_FD_V  0x0000001FU
#define TWAIFD_PH1_FD_S  7
/** TWAIFD_PH2_FD : R/W; bitpos: [17:13]; default: 3;
 *  Configures the phase 2 segment of data bit rate.
 *  Measurement unit: time quanta
 */
#define TWAIFD_PH2_FD    0x0000001FU
#define TWAIFD_PH2_FD_M  (TWAIFD_PH2_FD_V << TWAIFD_PH2_FD_S)
#define TWAIFD_PH2_FD_V  0x0000001FU
#define TWAIFD_PH2_FD_S  13
/** TWAIFD_BRP_FD : R/W; bitpos: [26:19]; default: 4;
 *  Configures the baud-rate prescaler of data bit rate.
 *  Measurement unit: cycle of core clock.
 */
#define TWAIFD_BRP_FD    0x000000FFU
#define TWAIFD_BRP_FD_M  (TWAIFD_BRP_FD_V << TWAIFD_BRP_FD_S)
#define TWAIFD_BRP_FD_V  0x000000FFU
#define TWAIFD_BRP_FD_S  19
/** TWAIFD_SJW_FD : R/W; bitpos: [31:27]; default: 2;
 *  Represents the synchronization jump width in data bit time.
 *  Measurement unit: time quanta
 */
#define TWAIFD_SJW_FD    0x0000001FU
#define TWAIFD_SJW_FD_M  (TWAIFD_SJW_FD_V << TWAIFD_SJW_FD_S)
#define TWAIFD_SJW_FD_V  0x0000001FU
#define TWAIFD_SJW_FD_S  27

/** TWAIFD_EWL_ERP_FAULT_STATE_REG register
 *  TWAI FD error threshold and status register
 */
#define TWAIFD_EWL_ERP_FAULT_STATE_REG (DR_REG_TWAIFD_BASE + 0x2c)
/** TWAIFD_EW_LIMIT : R/W; bitpos: [7:0]; default: 96;
 *  Error warning limit. If error warning limit is reached interrupt can be generated.
 *  Error warning limit
 *  indicates heavily disturbed bus.
 */
#define TWAIFD_EW_LIMIT    0x000000FFU
#define TWAIFD_EW_LIMIT_M  (TWAIFD_EW_LIMIT_V << TWAIFD_EW_LIMIT_S)
#define TWAIFD_EW_LIMIT_V  0x000000FFU
#define TWAIFD_EW_LIMIT_S  0
/** TWAIFD_ERP_LIMIT : R/W; bitpos: [15:8]; default: 128;
 *  Error Passive Limit. When one of error counters (REC/TEC) exceeds this value, Fault
 *  confinement state
 *  changes to error-passive.
 */
#define TWAIFD_ERP_LIMIT    0x000000FFU
#define TWAIFD_ERP_LIMIT_M  (TWAIFD_ERP_LIMIT_V << TWAIFD_ERP_LIMIT_S)
#define TWAIFD_ERP_LIMIT_V  0x000000FFU
#define TWAIFD_ERP_LIMIT_S  8
/** TWAIFD_ERA : RO; bitpos: [16]; default: 0;
 *  Represents the fault state of error active.
 */
#define TWAIFD_ERA    (BIT(16))
#define TWAIFD_ERA_M  (TWAIFD_ERA_V << TWAIFD_ERA_S)
#define TWAIFD_ERA_V  0x00000001U
#define TWAIFD_ERA_S  16
/** TWAIFD_ERP : RO; bitpos: [17]; default: 0;
 *  Represents the fault state of error passive.
 */
#define TWAIFD_ERP    (BIT(17))
#define TWAIFD_ERP_M  (TWAIFD_ERP_V << TWAIFD_ERP_S)
#define TWAIFD_ERP_V  0x00000001U
#define TWAIFD_ERP_S  17
/** TWAIFD_BOF : RO; bitpos: [18]; default: 1;
 *  Represents the fault state of bus off.
 */
#define TWAIFD_BOF    (BIT(18))
#define TWAIFD_BOF_M  (TWAIFD_BOF_V << TWAIFD_BOF_S)
#define TWAIFD_BOF_V  0x00000001U
#define TWAIFD_BOF_S  18

/** TWAIFD_REC_TEC_REG register
 *  TWAI FD error counters status register
 */
#define TWAIFD_REC_TEC_REG (DR_REG_TWAIFD_BASE + 0x30)
/** TWAIFD_REC_VAL : RO; bitpos: [8:0]; default: 0;
 *  Represents the receiver error counter value.
 */
#define TWAIFD_REC_VAL    0x000001FFU
#define TWAIFD_REC_VAL_M  (TWAIFD_REC_VAL_V << TWAIFD_REC_VAL_S)
#define TWAIFD_REC_VAL_V  0x000001FFU
#define TWAIFD_REC_VAL_S  0
/** TWAIFD_TEC_VAL : RO; bitpos: [24:16]; default: 0;
 *  Represents the transmitter error counter value.
 */
#define TWAIFD_TEC_VAL    0x000001FFU
#define TWAIFD_TEC_VAL_M  (TWAIFD_TEC_VAL_V << TWAIFD_TEC_VAL_S)
#define TWAIFD_TEC_VAL_V  0x000001FFU
#define TWAIFD_TEC_VAL_S  16

/** TWAIFD_ERR_NORM_ERR_FD_REG register
 *  TWAI FD special error counters status register
 */
#define TWAIFD_ERR_NORM_ERR_FD_REG (DR_REG_TWAIFD_BASE + 0x34)
/** TWAIFD_ERR_NORM_VAL : RO; bitpos: [15:0]; default: 0;
 *  Represents the number of error in the nominal bit time.
 */
#define TWAIFD_ERR_NORM_VAL    0x0000FFFFU
#define TWAIFD_ERR_NORM_VAL_M  (TWAIFD_ERR_NORM_VAL_V << TWAIFD_ERR_NORM_VAL_S)
#define TWAIFD_ERR_NORM_VAL_V  0x0000FFFFU
#define TWAIFD_ERR_NORM_VAL_S  0
/** TWAIFD_ERR_FD_VAL : RO; bitpos: [31:16]; default: 0;
 *  Represents the number of error in the data bit time.
 */
#define TWAIFD_ERR_FD_VAL    0x0000FFFFU
#define TWAIFD_ERR_FD_VAL_M  (TWAIFD_ERR_FD_VAL_V << TWAIFD_ERR_FD_VAL_S)
#define TWAIFD_ERR_FD_VAL_V  0x0000FFFFU
#define TWAIFD_ERR_FD_VAL_S  16

/** TWAIFD_CTR_PRES_REG register
 *  TWAI FD error counters pre-define configuration register
 */
#define TWAIFD_CTR_PRES_REG (DR_REG_TWAIFD_BASE + 0x38)
/** TWAIFD_CTPV : WO; bitpos: [8:0]; default: 0;
 *  Configures the pre-defined value to set the error counter.
 */
#define TWAIFD_CTPV    0x000001FFU
#define TWAIFD_CTPV_M  (TWAIFD_CTPV_V << TWAIFD_CTPV_S)
#define TWAIFD_CTPV_V  0x000001FFU
#define TWAIFD_CTPV_S  0
/** TWAIFD_PTX : WT; bitpos: [9]; default: 0;
 *  Configures whether or not to set the receiver error counter into the value of
 *  pre-defined value.
 *  0: invalid
 *  1: set
 */
#define TWAIFD_PTX    (BIT(9))
#define TWAIFD_PTX_M  (TWAIFD_PTX_V << TWAIFD_PTX_S)
#define TWAIFD_PTX_V  0x00000001U
#define TWAIFD_PTX_S  9
/** TWAIFD_PRX : WT; bitpos: [10]; default: 0;
 *  Configures whether or not to set the transmitter error counter into the value of
 *  pre-defined value.
 *  0: invalid
 *  1: set
 */
#define TWAIFD_PRX    (BIT(10))
#define TWAIFD_PRX_M  (TWAIFD_PRX_V << TWAIFD_PRX_S)
#define TWAIFD_PRX_V  0x00000001U
#define TWAIFD_PRX_S  10
/** TWAIFD_ENORM : WO; bitpos: [11]; default: 0;
 *  Configures whether or not to erase the error counter of nominal bit time.
 *  0: invalid
 *  1: erase
 */
#define TWAIFD_ENORM    (BIT(11))
#define TWAIFD_ENORM_M  (TWAIFD_ENORM_V << TWAIFD_ENORM_S)
#define TWAIFD_ENORM_V  0x00000001U
#define TWAIFD_ENORM_S  11
/** TWAIFD_EFD : WO; bitpos: [12]; default: 0;
 *  Configures whether or not to erase the error counter of data bit time.
 *  0: invalid
 *  1: erase
 */
#define TWAIFD_EFD    (BIT(12))
#define TWAIFD_EFD_M  (TWAIFD_EFD_V << TWAIFD_EFD_S)
#define TWAIFD_EFD_V  0x00000001U
#define TWAIFD_EFD_S  12

/** TWAIFD_FILTER_A_MASK_REG register
 *  TWAI FD filter A mask value register
 */
#define TWAIFD_FILTER_A_MASK_REG (DR_REG_TWAIFD_BASE + 0x3c)
/** TWAIFD_BIT_MASK_A_VAL : R/W; bitpos: [28:0]; default: 0;
 *  Filter A mask. The identifier format is the same as in IDENTIFIER_W of TXT buffer
 *  or RX
 *  buffer. If filter A is not present, writes to this register have no effect and read
 *  will return all zeroes.
 */
#define TWAIFD_BIT_MASK_A_VAL    0x1FFFFFFFU
#define TWAIFD_BIT_MASK_A_VAL_M  (TWAIFD_BIT_MASK_A_VAL_V << TWAIFD_BIT_MASK_A_VAL_S)
#define TWAIFD_BIT_MASK_A_VAL_V  0x1FFFFFFFU
#define TWAIFD_BIT_MASK_A_VAL_S  0

