espressif/esp-idf/components/soc/esp32h4/register/soc/twaifd_reg.h
/** TWAIFD_FILTER_A_VAL_REG register
 *  TWAI FD filter A bit value register
 */
#define TWAIFD_FILTER_A_VAL_REG (DR_REG_TWAIFD_BASE + 0x40)
/** TWAIFD_BIT_VAL_A_VAL : R/W; bitpos: [28:0]; default: 0;
 *  Filter A value. The identifier format is the same as in IDENTIFIER_W of TXT buffer
 *  or RX buffer.
 *  If filter A is not present, writes to this register have no effect and read will
 *  return all zeroes.
 */
#define TWAIFD_BIT_VAL_A_VAL    0x1FFFFFFFU
#define TWAIFD_BIT_VAL_A_VAL_M  (TWAIFD_BIT_VAL_A_VAL_V << TWAIFD_BIT_VAL_A_VAL_S)
#define TWAIFD_BIT_VAL_A_VAL_V  0x1FFFFFFFU
#define TWAIFD_BIT_VAL_A_VAL_S  0

/** TWAIFD_FILTER_B_MASK_REG register
 *  TWAI FD filter B mask value register
 */
#define TWAIFD_FILTER_B_MASK_REG (DR_REG_TWAIFD_BASE + 0x44)
/** TWAIFD_BIT_MASK_B_VAL : R/W; bitpos: [28:0]; default: 0;
 *  Filter B mask. The identifier format is the same as in IDENTIFIER_W of TXT buffer
 *  or RX
 *  buffer. If filter A is not present, writes to this register have no effect and read
 *  will return all zeroes.
 */
#define TWAIFD_BIT_MASK_B_VAL    0x1FFFFFFFU
#define TWAIFD_BIT_MASK_B_VAL_M  (TWAIFD_BIT_MASK_B_VAL_V << TWAIFD_BIT_MASK_B_VAL_S)
#define TWAIFD_BIT_MASK_B_VAL_V  0x1FFFFFFFU
#define TWAIFD_BIT_MASK_B_VAL_S  0

/** TWAIFD_FILTER_B_VAL_REG register
 *  TWAI FD filter B bit value register
 */
#define TWAIFD_FILTER_B_VAL_REG (DR_REG_TWAIFD_BASE + 0x48)
/** TWAIFD_BIT_VAL_B_VAL : R/W; bitpos: [28:0]; default: 0;
 *  Filter B value. The identifier format is the same as in IDENTIFIER_W of TXT buffer
 *  or RX buffer.
 *  If filter A is not present, writes to this register have no effect and read will
 *  return all zeroes.
 */
#define TWAIFD_BIT_VAL_B_VAL    0x1FFFFFFFU
#define TWAIFD_BIT_VAL_B_VAL_M  (TWAIFD_BIT_VAL_B_VAL_V << TWAIFD_BIT_VAL_B_VAL_S)
#define TWAIFD_BIT_VAL_B_VAL_V  0x1FFFFFFFU
#define TWAIFD_BIT_VAL_B_VAL_S  0

/** TWAIFD_FILTER_C_MASK_REG register
 *  TWAI FD filter C mask value register
 */
#define TWAIFD_FILTER_C_MASK_REG (DR_REG_TWAIFD_BASE + 0x4c)
/** TWAIFD_BIT_MASK_C_VAL : R/W; bitpos: [28:0]; default: 0;
 *  Filter C mask. The identifier format is the same as in IDENTIFIER_W of TXT buffer
 *  or RX
 *  buffer. If filter A is not present, writes to this register have no effect and read
 *  will return all zeroes.
 */
#define TWAIFD_BIT_MASK_C_VAL    0x1FFFFFFFU
#define TWAIFD_BIT_MASK_C_VAL_M  (TWAIFD_BIT_MASK_C_VAL_V << TWAIFD_BIT_MASK_C_VAL_S)
#define TWAIFD_BIT_MASK_C_VAL_V  0x1FFFFFFFU
#define TWAIFD_BIT_MASK_C_VAL_S  0

/** TWAIFD_FILTER_C_VAL_REG register
 *  TWAI FD filter C bit value register
 */
#define TWAIFD_FILTER_C_VAL_REG (DR_REG_TWAIFD_BASE + 0x50)
/** TWAIFD_BIT_VAL_C_VAL : R/W; bitpos: [28:0]; default: 0;
 *  Filter C value. The identifier format is the same as in IDENTIFIER_W of TXT buffer
 *  or RX buffer.
 *  If filter A is not present, writes to this register have no effect and read will
 *  return all zeroes.
 */
#define TWAIFD_BIT_VAL_C_VAL    0x1FFFFFFFU
#define TWAIFD_BIT_VAL_C_VAL_M  (TWAIFD_BIT_VAL_C_VAL_V << TWAIFD_BIT_VAL_C_VAL_S)
#define TWAIFD_BIT_VAL_C_VAL_V  0x1FFFFFFFU
#define TWAIFD_BIT_VAL_C_VAL_S  0

/** TWAIFD_FILTER_RAN_LOW_REG register
 *  TWAI FD filter range low value register
 */
#define TWAIFD_FILTER_RAN_LOW_REG (DR_REG_TWAIFD_BASE + 0x54)
/** TWAIFD_BIT_RAN_LOW_VAL : R/W; bitpos: [28:0]; default: 0;
 *  Filter Range Low threshold. The identifier format is the same as in IDENTIFIER_W of
 *  TXT
 *  buffer or RX buffer. If Range filter is not supported, writes to this register have
 *  no effect and read will return all
 *  Zeroes.
 */
#define TWAIFD_BIT_RAN_LOW_VAL    0x1FFFFFFFU
#define TWAIFD_BIT_RAN_LOW_VAL_M  (TWAIFD_BIT_RAN_LOW_VAL_V << TWAIFD_BIT_RAN_LOW_VAL_S)
#define TWAIFD_BIT_RAN_LOW_VAL_V  0x1FFFFFFFU
#define TWAIFD_BIT_RAN_LOW_VAL_S  0

/** TWAIFD_FILTER_RAN_HIGH_REG register
 *  TWAI FD filter range high value register
 */
#define TWAIFD_FILTER_RAN_HIGH_REG (DR_REG_TWAIFD_BASE + 0x58)
/** TWAIFD_BIT_RAN_HIGH_VAL : R/W; bitpos: [28:0]; default: 0;
 *  Range filter High threshold. The identifier format is the same as in IDENTIFIER_W
 *  of TXT
 *  buffer or RX buffer. If Range filter is not supported, writes to this register have
 *  no effect and read will return all
 *  Zeroes.
 */
#define TWAIFD_BIT_RAN_HIGH_VAL    0x1FFFFFFFU
#define TWAIFD_BIT_RAN_HIGH_VAL_M  (TWAIFD_BIT_RAN_HIGH_VAL_V << TWAIFD_BIT_RAN_HIGH_VAL_S)
#define TWAIFD_BIT_RAN_HIGH_VAL_V  0x1FFFFFFFU
#define TWAIFD_BIT_RAN_HIGH_VAL_S  0

/** TWAIFD_FILTER_CONTROL_FILTER_STATUS_REG register
 *  TWAI FD filter control register
 */
#define TWAIFD_FILTER_CONTROL_FILTER_STATUS_REG (DR_REG_TWAIFD_BASE + 0x5c)
/** TWAIFD_FANB : R/W; bitpos: [0]; default: 1;
 *  CAN Basic Frame is accepted by filter A.
 */
#define TWAIFD_FANB    (BIT(0))
#define TWAIFD_FANB_M  (TWAIFD_FANB_V << TWAIFD_FANB_S)
#define TWAIFD_FANB_V  0x00000001U
#define TWAIFD_FANB_S  0
/** TWAIFD_FANE : R/W; bitpos: [1]; default: 1;
 *  CAN Extended Frame is accepted by Filter A.
 */
#define TWAIFD_FANE    (BIT(1))
#define TWAIFD_FANE_M  (TWAIFD_FANE_V << TWAIFD_FANE_S)
#define TWAIFD_FANE_V  0x00000001U
#define TWAIFD_FANE_S  1
/** TWAIFD_FAFB : R/W; bitpos: [2]; default: 1;
 *  CAN FD Basic Frame is accepted by filter A.
 */
#define TWAIFD_FAFB    (BIT(2))
#define TWAIFD_FAFB_M  (TWAIFD_FAFB_V << TWAIFD_FAFB_S)
#define TWAIFD_FAFB_V  0x00000001U
#define TWAIFD_FAFB_S  2
/** TWAIFD_FAFE : R/W; bitpos: [3]; default: 1;
 *  CAN FD Extended Frame is accepted by filter A.
 */
#define TWAIFD_FAFE    (BIT(3))
#define TWAIFD_FAFE_M  (TWAIFD_FAFE_V << TWAIFD_FAFE_S)
#define TWAIFD_FAFE_V  0x00000001U
#define TWAIFD_FAFE_S  3
/** TWAIFD_FBNB : R/W; bitpos: [4]; default: 0;
 *  CAN Basic Frame is accepted by filter B.
 */
#define TWAIFD_FBNB    (BIT(4))
#define TWAIFD_FBNB_M  (TWAIFD_FBNB_V << TWAIFD_FBNB_S)
#define TWAIFD_FBNB_V  0x00000001U
#define TWAIFD_FBNB_S  4
/** TWAIFD_FBNE : R/W; bitpos: [5]; default: 0;
 *  CAN Extended Frame is accepted by Filter B.
 */
#define TWAIFD_FBNE    (BIT(5))
#define TWAIFD_FBNE_M  (TWAIFD_FBNE_V << TWAIFD_FBNE_S)
#define TWAIFD_FBNE_V  0x00000001U
#define TWAIFD_FBNE_S  5
/** TWAIFD_FBFB : R/W; bitpos: [6]; default: 0;
 *  CAN FD Basic Frame is accepted by filter B.
 */
#define TWAIFD_FBFB    (BIT(6))
#define TWAIFD_FBFB_M  (TWAIFD_FBFB_V << TWAIFD_FBFB_S)
#define TWAIFD_FBFB_V  0x00000001U
#define TWAIFD_FBFB_S  6
/** TWAIFD_FBFE : R/W; bitpos: [7]; default: 0;
 *  CAN FD Extended Frame is accepted by filter B.
 */
#define TWAIFD_FBFE    (BIT(7))
#define TWAIFD_FBFE_M  (TWAIFD_FBFE_V << TWAIFD_FBFE_S)
#define TWAIFD_FBFE_V  0x00000001U
#define TWAIFD_FBFE_S  7
/** TWAIFD_FCNB : R/W; bitpos: [8]; default: 0;
 *  CAN Basic Frame is accepted by filter C.
 */
#define TWAIFD_FCNB    (BIT(8))
#define TWAIFD_FCNB_M  (TWAIFD_FCNB_V << TWAIFD_FCNB_S)
#define TWAIFD_FCNB_V  0x00000001U
#define TWAIFD_FCNB_S  8
/** TWAIFD_FCNE : R/W; bitpos: [9]; default: 0;
 *  CAN Extended Frame is accepted by Filter C.
 */
#define TWAIFD_FCNE    (BIT(9))
#define TWAIFD_FCNE_M  (TWAIFD_FCNE_V << TWAIFD_FCNE_S)
#define TWAIFD_FCNE_V  0x00000001U
#define TWAIFD_FCNE_S  9
/** TWAIFD_FCFB : R/W; bitpos: [10]; default: 0;
 *  CAN FD Basic Frame is accepted by filter C.
 */
#define TWAIFD_FCFB    (BIT(10))
#define TWAIFD_FCFB_M  (TWAIFD_FCFB_V << TWAIFD_FCFB_S)
#define TWAIFD_FCFB_V  0x00000001U
#define TWAIFD_FCFB_S  10
/** TWAIFD_FCFE : R/W; bitpos: [11]; default: 0;
 *  CAN FD Extended Frame is accepted by filter C.
 */
#define TWAIFD_FCFE    (BIT(11))
#define TWAIFD_FCFE_M  (TWAIFD_FCFE_V << TWAIFD_FCFE_S)
#define TWAIFD_FCFE_V  0x00000001U
#define TWAIFD_FCFE_S  11
/** TWAIFD_FRNB : R/W; bitpos: [12]; default: 0;
 *  CAN Basic Frame is accepted by Range filter.
 */
#define TWAIFD_FRNB    (BIT(12))
#define TWAIFD_FRNB_M  (TWAIFD_FRNB_V << TWAIFD_FRNB_S)
#define TWAIFD_FRNB_V  0x00000001U
#define TWAIFD_FRNB_S  12
/** TWAIFD_FRNE : R/W; bitpos: [13]; default: 0;
 *  CAN Extended Frame is accepted by Range filter.
 */
#define TWAIFD_FRNE    (BIT(13))
#define TWAIFD_FRNE_M  (TWAIFD_FRNE_V << TWAIFD_FRNE_S)
#define TWAIFD_FRNE_V  0x00000001U
#define TWAIFD_FRNE_S  13
/** TWAIFD_FRFB : R/W; bitpos: [14]; default: 0;
 *  CAN FD Basic Frame is accepted by Range filter.
 */
#define TWAIFD_FRFB    (BIT(14))
#define TWAIFD_FRFB_M  (TWAIFD_FRFB_V << TWAIFD_FRFB_S)
#define TWAIFD_FRFB_V  0x00000001U
#define TWAIFD_FRFB_S  14
/** TWAIFD_FRFE : R/W; bitpos: [15]; default: 0;
 *  CAN FD Extended Frame is accepted by Range filter.
 */
#define TWAIFD_FRFE    (BIT(15))
#define TWAIFD_FRFE_M  (TWAIFD_FRFE_V << TWAIFD_FRFE_S)
#define TWAIFD_FRFE_V  0x00000001U
#define TWAIFD_FRFE_S  15
/** TWAIFD_SFA : RO; bitpos: [16]; default: 1;
 *  Logic 1 when Filter A is available. Otherwise logic 0.
 */
#define TWAIFD_SFA    (BIT(16))
#define TWAIFD_SFA_M  (TWAIFD_SFA_V << TWAIFD_SFA_S)
#define TWAIFD_SFA_V  0x00000001U
#define TWAIFD_SFA_S  16
/** TWAIFD_SFB : RO; bitpos: [17]; default: 1;
 *  Logic 1 when Filter B is available. Otherwise logic 0.
 */
#define TWAIFD_SFB    (BIT(17))
#define TWAIFD_SFB_M  (TWAIFD_SFB_V << TWAIFD_SFB_S)
#define TWAIFD_SFB_V  0x00000001U
#define TWAIFD_SFB_S  17
/** TWAIFD_SFC : RO; bitpos: [18]; default: 1;
 *  Logic 1 when Filter C is available. Otherwise logic 0.
 */
#define TWAIFD_SFC    (BIT(18))
#define TWAIFD_SFC_M  (TWAIFD_SFC_V << TWAIFD_SFC_S)
#define TWAIFD_SFC_V  0x00000001U
#define TWAIFD_SFC_S  18
/** TWAIFD_SFR : RO; bitpos: [19]; default: 1;
 *  Logic 1 when Range Filter is available. Otherwise logic 0.
 */
#define TWAIFD_SFR    (BIT(19))
#define TWAIFD_SFR_M  (TWAIFD_SFR_V << TWAIFD_SFR_S)
#define TWAIFD_SFR_V  0x00000001U
#define TWAIFD_SFR_S  19

/** TWAIFD_RX_MEM_INFO_REG register
 *  TWAI FD rx memory information register
 */
#define TWAIFD_RX_MEM_INFO_REG (DR_REG_TWAIFD_BASE + 0x60)
/** TWAIFD_RX_BUFF_SIZE : RO; bitpos: [12:0]; default: 128;
 *  Size of RX buffer in 32-bit words.
 */
#define TWAIFD_RX_BUFF_SIZE    0x00001FFFU
#define TWAIFD_RX_BUFF_SIZE_M  (TWAIFD_RX_BUFF_SIZE_V << TWAIFD_RX_BUFF_SIZE_S)
#define TWAIFD_RX_BUFF_SIZE_V  0x00001FFFU
#define TWAIFD_RX_BUFF_SIZE_S  0
/** TWAIFD_RX_FREE : RO; bitpos: [28:16]; default: 128;
 *  Number of free 32 bit words in RX buffer.
 */
#define TWAIFD_RX_FREE    0x00001FFFU
#define TWAIFD_RX_FREE_M  (TWAIFD_RX_FREE_V << TWAIFD_RX_FREE_S)
#define TWAIFD_RX_FREE_V  0x00001FFFU
#define TWAIFD_RX_FREE_S  16

/** TWAIFD_RX_POINTERS_REG register
 *  TWAI FD rx memory pointer information register
 */
#define TWAIFD_RX_POINTERS_REG (DR_REG_TWAIFD_BASE + 0x64)
/** TWAIFD_RX_WPP : RO; bitpos: [11:0]; default: 0;
 *  Write pointer position in RX buffer. Upon store of received frame write pointer is
 *  updated.
 */
#define TWAIFD_RX_WPP    0x00000FFFU
#define TWAIFD_RX_WPP_M  (TWAIFD_RX_WPP_V << TWAIFD_RX_WPP_S)
#define TWAIFD_RX_WPP_V  0x00000FFFU
#define TWAIFD_RX_WPP_S  0
/** TWAIFD_RX_RPP : RO; bitpos: [27:16]; default: 0;
 *  Read pointer position in RX buffer. Upon read of received frame read pointer is
 *  updated.
 */
#define TWAIFD_RX_RPP    0x00000FFFU
#define TWAIFD_RX_RPP_M  (TWAIFD_RX_RPP_V << TWAIFD_RX_RPP_S)
#define TWAIFD_RX_RPP_V  0x00000FFFU
#define TWAIFD_RX_RPP_S  16

/** TWAIFD_RX_STATUS_RX_SETTINGS_REG register
 *  TWAI FD rx status & setting register
 */
#define TWAIFD_RX_STATUS_RX_SETTINGS_REG (DR_REG_TWAIFD_BASE + 0x68)
/** TWAIFD_RXE : RO; bitpos: [0]; default: 1;
 *  Represents whether or not the RX buffer is empty. RX buffer is empty. There is no
 *  CAN Frame stored in it.
 *  0: not empty
 *  1: empty
 */
#define TWAIFD_RXE    (BIT(0))
#define TWAIFD_RXE_M  (TWAIFD_RXE_V << TWAIFD_RXE_S)
#define TWAIFD_RXE_V  0x00000001U
#define TWAIFD_RXE_S  0
/** TWAIFD_RXF : RO; bitpos: [1]; default: 0;
 *  Represents whether or not the RX buffer is full. RX buffer is full, all memory
 *  words of RX buffer are occupied.
 *  0: not full
 *  1: full
 */
#define TWAIFD_RXF    (BIT(1))
#define TWAIFD_RXF_M  (TWAIFD_RXF_V << TWAIFD_RXF_S)
#define TWAIFD_RXF_V  0x00000001U
#define TWAIFD_RXF_S  1
/** TWAIFD_RXMOF : RO; bitpos: [2]; default: 0;
 *  Represents the number of received frame in RX buffer.
 *  RX Buffer middle of frame. When RXMOF = 1, next read from RX_DATA register will
 *  return other than first
 *  word (FRAME_FORMAT_W) of CAN frame.
 */
#define TWAIFD_RXMOF    (BIT(2))
#define TWAIFD_RXMOF_M  (TWAIFD_RXMOF_V << TWAIFD_RXMOF_S)
#define TWAIFD_RXMOF_V  0x00000001U
#define TWAIFD_RXMOF_S  2
/** TWAIFD_RXFRC : RO; bitpos: [14:4]; default: 0;
 *  RX buffer frame count. Number of CAN frames stored in RX buffer.
 */
#define TWAIFD_RXFRC    0x000007FFU
#define TWAIFD_RXFRC_M  (TWAIFD_RXFRC_V << TWAIFD_RXFRC_S)
#define TWAIFD_RXFRC_V  0x000007FFU
#define TWAIFD_RXFRC_S  4
/** TWAIFD_RTSOP : R/W; bitpos: [16]; default: 0;
 *  Receive buffer timestamp option. This register should be modified only when
 *  SETTINGS[ENA]=0.
 *  0b0 - RTS_END - Timestamp of received frame in RX FIFO is captured in last bit of
 *  EOF field.
 *  0b1 - RTS_BEG - Timestamp of received frame in RX FIFO is captured in SOF field.
 */
#define TWAIFD_RTSOP    (BIT(16))
#define TWAIFD_RTSOP_M  (TWAIFD_RTSOP_V << TWAIFD_RTSOP_S)
#define TWAIFD_RTSOP_V  0x00000001U
#define TWAIFD_RTSOP_S  16

