espressif/esp-idf/components/soc/esp32h4/register/soc/twaifd_reg.h
/** TWAIFD_RX_DATA_REG register
 *  TWAI FD received data register
 */
#define TWAIFD_RX_DATA_REG (DR_REG_TWAIFD_BASE + 0x6c)
/** TWAIFD_RX_DATA : RO; bitpos: [31:0]; default: 0;
 *  RX buffer data at read pointer position in FIFO. By reading from this register,
 *  read pointer is auto-
 *  matically increased, as long as there is next data word stored in RX buffer. First
 *  stored word in the buffer is
 *  FRAME_FORMAT_W, next IDENTIFIER_W etc. This register shall be read by 32 bit access.
 */
#define TWAIFD_RX_DATA    0xFFFFFFFFU
#define TWAIFD_RX_DATA_M  (TWAIFD_RX_DATA_V << TWAIFD_RX_DATA_S)
#define TWAIFD_RX_DATA_V  0xFFFFFFFFU
#define TWAIFD_RX_DATA_S  0

/** TWAIFD_TX_STATUS_REG register
 *  TWAI FD TX buffer status register
 */
#define TWAIFD_TX_STATUS_REG (DR_REG_TWAIFD_BASE + 0x70)
/** TWAIFD_TXTB0_STATE : RO; bitpos: [3:0]; default: 8;
 *  Status of TXT buffer 1.
 *  0b0000 - TXT_NOT_EXIST - TXT buffer does not exist in the core (applies only to TXT
 *  buffers 3-8, when
 *  CAN FD was synthesized with less than 8 TXT buffers).
 *  0b0001 - TXT_RDY - TXT buffer is in "Ready" state, it is waiting for CAN FD to
 *  start transmission from it.
 *  0b0010 - TXT_TRAN - TXT buffer is in "TX in progress" state. CAN FD is
 *  transmitting frame.
 *  0b0011 - TXT_ABTP - TXT buffer is in "Abort in progress" state.
 *  0b0100 - TXT_TOK - TXT buffer is in "TX OK" state.
 *  0b0110 - TXT_ERR - TXT buffer is in "Failed" state.
 *  0b0111 - TXT_ABT - TXT buffer is in "Aborted" state.
 *  0b1000 - TXT_ETY - TXT buffer is in "Empty" state.
 */
#define TWAIFD_TXTB0_STATE    0x0000000FU
#define TWAIFD_TXTB0_STATE_M  (TWAIFD_TXTB0_STATE_V << TWAIFD_TXTB0_STATE_S)
#define TWAIFD_TXTB0_STATE_V  0x0000000FU
#define TWAIFD_TXTB0_STATE_S  0
/** TWAIFD_TX2S : RO; bitpos: [7:4]; default: 8;
 *  Status of TXT buffer 2. Bit field meaning is analogous to TX1S.
 */
#define TWAIFD_TX2S    0x0000000FU
#define TWAIFD_TX2S_M  (TWAIFD_TX2S_V << TWAIFD_TX2S_S)
#define TWAIFD_TX2S_V  0x0000000FU
#define TWAIFD_TX2S_S  4
/** TWAIFD_TX3S : RO; bitpos: [11:8]; default: 8;
 *  Status of TXT buffer 3. Bit field meaning is analogous to TX1S.
 */
#define TWAIFD_TX3S    0x0000000FU
#define TWAIFD_TX3S_M  (TWAIFD_TX3S_V << TWAIFD_TX3S_S)
#define TWAIFD_TX3S_V  0x0000000FU
#define TWAIFD_TX3S_S  8
/** TWAIFD_TX4S : RO; bitpos: [15:12]; default: 8;
 *  Status of TXT buffer 4. Bit field meaning is analogous to TX1S.
 */
#define TWAIFD_TX4S    0x0000000FU
#define TWAIFD_TX4S_M  (TWAIFD_TX4S_V << TWAIFD_TX4S_S)
#define TWAIFD_TX4S_V  0x0000000FU
#define TWAIFD_TX4S_S  12
/** TWAIFD_TX5S : RO; bitpos: [19:16]; default: 0;
 *  Status of TXT buffer 5. Bit field meaning is analogous to TX1S.
 */
#define TWAIFD_TX5S    0x0000000FU
#define TWAIFD_TX5S_M  (TWAIFD_TX5S_V << TWAIFD_TX5S_S)
#define TWAIFD_TX5S_V  0x0000000FU
#define TWAIFD_TX5S_S  16
/** TWAIFD_TX6S : RO; bitpos: [23:20]; default: 0;
 *  Status of TXT buffer 6. Bit field meaning is analogous to TX1S.
 */
#define TWAIFD_TX6S    0x0000000FU
#define TWAIFD_TX6S_M  (TWAIFD_TX6S_V << TWAIFD_TX6S_S)
#define TWAIFD_TX6S_V  0x0000000FU
#define TWAIFD_TX6S_S  20
/** TWAIFD_TX7S : RO; bitpos: [27:24]; default: 0;
 *  Status of TXT buffer 7. Bit field meaning is analogous to TX1S.
 */
#define TWAIFD_TX7S    0x0000000FU
#define TWAIFD_TX7S_M  (TWAIFD_TX7S_V << TWAIFD_TX7S_S)
#define TWAIFD_TX7S_V  0x0000000FU
#define TWAIFD_TX7S_S  24
/** TWAIFD_TX8S : RO; bitpos: [31:28]; default: 0;
 *  Status of TXT buffer 8. Bit field meaning is analogous to TX1S.
 */
#define TWAIFD_TX8S    0x0000000FU
#define TWAIFD_TX8S_M  (TWAIFD_TX8S_V << TWAIFD_TX8S_S)
#define TWAIFD_TX8S_V  0x0000000FU
#define TWAIFD_TX8S_S  28

/** TWAIFD_TX_COMMAND_TXTB_INFO_REG register
 *  TWAI FD TXT buffer command & information register
 */
#define TWAIFD_TX_COMMAND_TXTB_INFO_REG (DR_REG_TWAIFD_BASE + 0x74)
/** TWAIFD_TXCE : WO; bitpos: [0]; default: 0;
 *  Issues "set empty" command.
 */
#define TWAIFD_TXCE    (BIT(0))
#define TWAIFD_TXCE_M  (TWAIFD_TXCE_V << TWAIFD_TXCE_S)
#define TWAIFD_TXCE_V  0x00000001U
#define TWAIFD_TXCE_S  0
/** TWAIFD_TXCR : WO; bitpos: [1]; default: 0;
 *  Issues "set ready" command.
 */
#define TWAIFD_TXCR    (BIT(1))
#define TWAIFD_TXCR_M  (TWAIFD_TXCR_V << TWAIFD_TXCR_S)
#define TWAIFD_TXCR_V  0x00000001U
#define TWAIFD_TXCR_S  1
/** TWAIFD_TXCA : WO; bitpos: [2]; default: 0;
 *  Issues "set abort" command.
 */
#define TWAIFD_TXCA    (BIT(2))
#define TWAIFD_TXCA_M  (TWAIFD_TXCA_V << TWAIFD_TXCA_S)
#define TWAIFD_TXCA_V  0x00000001U
#define TWAIFD_TXCA_S  2
/** TWAIFD_TXB1 : WO; bitpos: [8]; default: 0;
 *  Command is issued to TXT Buffer 1.
 */
#define TWAIFD_TXB1    (BIT(8))
#define TWAIFD_TXB1_M  (TWAIFD_TXB1_V << TWAIFD_TXB1_S)
#define TWAIFD_TXB1_V  0x00000001U
#define TWAIFD_TXB1_S  8
/** TWAIFD_TXB2 : WO; bitpos: [9]; default: 0;
 *  Command is issued to TXT Buffer 2.
 */
#define TWAIFD_TXB2    (BIT(9))
#define TWAIFD_TXB2_M  (TWAIFD_TXB2_V << TWAIFD_TXB2_S)
#define TWAIFD_TXB2_V  0x00000001U
#define TWAIFD_TXB2_S  9
/** TWAIFD_TXB3 : WO; bitpos: [10]; default: 0;
 *  Command is issued to TXT Buffer 3. If number of TXT Buffers is less than 3, this
 *  field is reserved and has no
 *  Function.
 */
#define TWAIFD_TXB3    (BIT(10))
#define TWAIFD_TXB3_M  (TWAIFD_TXB3_V << TWAIFD_TXB3_S)
#define TWAIFD_TXB3_V  0x00000001U
#define TWAIFD_TXB3_S  10
/** TWAIFD_TXB4 : WO; bitpos: [11]; default: 0;
 *  Command is issued to TXT Buffer 4. If number of TXT Buffers is less than 4, this
 *  field is reserved and has no
 *  Function.
 */
#define TWAIFD_TXB4    (BIT(11))
#define TWAIFD_TXB4_M  (TWAIFD_TXB4_V << TWAIFD_TXB4_S)
#define TWAIFD_TXB4_V  0x00000001U
#define TWAIFD_TXB4_S  11
/** TWAIFD_TXB5 : WO; bitpos: [12]; default: 0;
 *  Command is issued to TXT Buffer 5. If number of TXT Buffers is less than 5, this
 *  field is reserved and has no
 *  Function.
 */
#define TWAIFD_TXB5    (BIT(12))
#define TWAIFD_TXB5_M  (TWAIFD_TXB5_V << TWAIFD_TXB5_S)
#define TWAIFD_TXB5_V  0x00000001U
#define TWAIFD_TXB5_S  12
/** TWAIFD_TXB6 : WO; bitpos: [13]; default: 0;
 *  Command is issued to TXT Buffer 6. If number of TXT Buffers is less than 6, this
 *  field is reserved and has no
 *  Function.
 */
#define TWAIFD_TXB6    (BIT(13))
#define TWAIFD_TXB6_M  (TWAIFD_TXB6_V << TWAIFD_TXB6_S)
#define TWAIFD_TXB6_V  0x00000001U
#define TWAIFD_TXB6_S  13
/** TWAIFD_TXB7 : WO; bitpos: [14]; default: 0;
 *  Command is issued to TXT Buffer 7. If number of TXT Buffers is less than 7, this
 *  field is reserved and has no
 *  Function.
 */
#define TWAIFD_TXB7    (BIT(14))
#define TWAIFD_TXB7_M  (TWAIFD_TXB7_V << TWAIFD_TXB7_S)
#define TWAIFD_TXB7_V  0x00000001U
#define TWAIFD_TXB7_S  14
/** TWAIFD_TXB8 : WO; bitpos: [15]; default: 0;
 *  Command is issued to TXT Buffer 8. If number of TXT Buffers is less than 8, this
 *  field is reserved and has no
 *  Function.
 */
#define TWAIFD_TXB8    (BIT(15))
#define TWAIFD_TXB8_M  (TWAIFD_TXB8_V << TWAIFD_TXB8_S)
#define TWAIFD_TXB8_V  0x00000001U
#define TWAIFD_TXB8_S  15
/** TWAIFD_TXT_BUFFER_COUNT : RO; bitpos: [19:16]; default: 4;
 *  Number of TXT buffers present in CAN FD. Lowest buffer is always 1. Highest
 *  buffer
 *  is at index equal to number of present buffers.
 */
#define TWAIFD_TXT_BUFFER_COUNT    0x0000000FU
#define TWAIFD_TXT_BUFFER_COUNT_M  (TWAIFD_TXT_BUFFER_COUNT_V << TWAIFD_TXT_BUFFER_COUNT_S)
#define TWAIFD_TXT_BUFFER_COUNT_V  0x0000000FU
#define TWAIFD_TXT_BUFFER_COUNT_S  16

/** TWAIFD_TX_PRIORITY_REG register
 *  TWAI FD TXT buffer command & information register
 */
#define TWAIFD_TX_PRIORITY_REG (DR_REG_TWAIFD_BASE + 0x78)
/** TWAIFD_TXT1P : R/W; bitpos: [2:0]; default: 1;
 *  Priority of TXT buffer 1.
 */
#define TWAIFD_TXT1P    0x00000007U
#define TWAIFD_TXT1P_M  (TWAIFD_TXT1P_V << TWAIFD_TXT1P_S)
#define TWAIFD_TXT1P_V  0x00000007U
#define TWAIFD_TXT1P_S  0
/** TWAIFD_TXT2P : R/W; bitpos: [6:4]; default: 0;
 *  Priority of TXT buffer 2.
 */
#define TWAIFD_TXT2P    0x00000007U
#define TWAIFD_TXT2P_M  (TWAIFD_TXT2P_V << TWAIFD_TXT2P_S)
#define TWAIFD_TXT2P_V  0x00000007U
#define TWAIFD_TXT2P_S  4
/** TWAIFD_TXT3P : R/W; bitpos: [10:8]; default: 0;
 *  Priority of TXT buffer 3. If number of TXT Buffers is less than 3, this field is
 *  reserved and has no function.
 */
#define TWAIFD_TXT3P    0x00000007U
#define TWAIFD_TXT3P_M  (TWAIFD_TXT3P_V << TWAIFD_TXT3P_S)
#define TWAIFD_TXT3P_V  0x00000007U
#define TWAIFD_TXT3P_S  8
/** TWAIFD_TXT4P : R/W; bitpos: [14:12]; default: 0;
 *  Priority of TXT buffer 4. If number of TXT Buffers is less than 4, this field is
 *  reserved and has no function.
 */
#define TWAIFD_TXT4P    0x00000007U
#define TWAIFD_TXT4P_M  (TWAIFD_TXT4P_V << TWAIFD_TXT4P_S)
#define TWAIFD_TXT4P_V  0x00000007U
#define TWAIFD_TXT4P_S  12
/** TWAIFD_TXT5P : R/W; bitpos: [18:16]; default: 0;
 *  Priority of TXT buffer 5. If number of TXT Buffers is less than 5, this field is
 *  reserved and has no function.
 */
#define TWAIFD_TXT5P    0x00000007U
#define TWAIFD_TXT5P_M  (TWAIFD_TXT5P_V << TWAIFD_TXT5P_S)
#define TWAIFD_TXT5P_V  0x00000007U
#define TWAIFD_TXT5P_S  16
/** TWAIFD_TXT6P : R/W; bitpos: [22:20]; default: 0;
 *  Priority of TXT buffer 6. If number of TXT Buffers is less than 6, this field is
 *  reserved and has no function.
 */
#define TWAIFD_TXT6P    0x00000007U
#define TWAIFD_TXT6P_M  (TWAIFD_TXT6P_V << TWAIFD_TXT6P_S)
#define TWAIFD_TXT6P_V  0x00000007U
#define TWAIFD_TXT6P_S  20
/** TWAIFD_TXT7P : R/W; bitpos: [26:24]; default: 0;
 *  Priority of TXT buffer 7. If number of TXT Buffers is less than 7, this field is
 *  reserved and has no function.
 */
#define TWAIFD_TXT7P    0x00000007U
#define TWAIFD_TXT7P_M  (TWAIFD_TXT7P_V << TWAIFD_TXT7P_S)
#define TWAIFD_TXT7P_V  0x00000007U
#define TWAIFD_TXT7P_S  24
/** TWAIFD_TXT8P : R/W; bitpos: [30:28]; default: 0;
 *  Priority of TXT buffer 8. If number of TXT Buffers is less than 8, this field is
 *  reserved and has no function.
 */
#define TWAIFD_TXT8P    0x00000007U
#define TWAIFD_TXT8P_M  (TWAIFD_TXT8P_V << TWAIFD_TXT8P_S)
#define TWAIFD_TXT8P_V  0x00000007U
#define TWAIFD_TXT8P_S  28

