espressif/esp-idf/components/soc/esp32h4/register/soc/twaifd_reg.h
/** TWAIFD_ERR_CAPT_RETR_CTR_ALC_TS_INFO_REG register
 *  TWAI FD error capture & retransmit counter & arbitration lost & timestamp
 *  integration information register
 */
#define TWAIFD_ERR_CAPT_RETR_CTR_ALC_TS_INFO_REG (DR_REG_TWAIFD_BASE + 0x7c)
/** TWAIFD_ERR_POS : RO; bitpos: [4:0]; default: 31;
 *  0b00000 - ERC_POS_SOF - Error in Start of Frame
 *  0b00001 - ERC_POS_ARB - Error in Arbitration Filed
 *  0b00010 - ERC_POS_CTRL - Error in Control field
 *  0b00011 - ERC_POS_DATA - Error in Data Field
 *  0b00100 - ERC_POS_CRC - Error in CRC Field
 *  0b00101 - ERC_POS_ACK - Error in CRC delimiter, ACK field or ACK delimiter
 *  0b00110 - ERC_POS_EOF - Error in End of frame field
 *  0b00111 - ERC_POS_ERR - Error during Error frame
 *  0b01000 - ERC_POS_OVRL - Error in Overload frame
 *  0b11111 - ERC_POS_OTHER - Other position of error
 */
#define TWAIFD_ERR_POS    0x0000001FU
#define TWAIFD_ERR_POS_M  (TWAIFD_ERR_POS_V << TWAIFD_ERR_POS_S)
#define TWAIFD_ERR_POS_V  0x0000001FU
#define TWAIFD_ERR_POS_S  0
/** TWAIFD_ERR_TYPE : RO; bitpos: [7:5]; default: 0;
 *  Type of last error.
 *  0b000 - ERC_BIT_ERR - Bit Error
 *  0b001 - ERC_CRC_ERR - CRC Error
 *  0b010 - ERC_FRM_ERR - Form Error
 *  0b011 - ERC_ACK_ERR - Acknowledge Error
 *  0b100 - ERC_STUF_ERR - Stuff Error
 */
#define TWAIFD_ERR_TYPE    0x00000007U
#define TWAIFD_ERR_TYPE_M  (TWAIFD_ERR_TYPE_V << TWAIFD_ERR_TYPE_S)
#define TWAIFD_ERR_TYPE_V  0x00000007U
#define TWAIFD_ERR_TYPE_S  5
/** TWAIFD_RETR_CTR_VAL : RO; bitpos: [11:8]; default: 0;
 *  Current value of retransmitt counter.
 */
#define TWAIFD_RETR_CTR_VAL    0x0000000FU
#define TWAIFD_RETR_CTR_VAL_M  (TWAIFD_RETR_CTR_VAL_V << TWAIFD_RETR_CTR_VAL_S)
#define TWAIFD_RETR_CTR_VAL_V  0x0000000FU
#define TWAIFD_RETR_CTR_VAL_S  8
/** TWAIFD_ALC_BIT : RO; bitpos: [20:16]; default: 0;
 *  Arbitration lost capture bit position. If ALC_ID_FIELD = ALC_BASE_ID then bit index
 *  of BASE identifier
 *  in which arbitration was lost is given as: 11 - ALC_VAL. If ALC_ID_FIELD =
 *  ALC_EXTENSION then bit index of
 *  EXTENDED identifier in which arbitration was lost is given as: 18 - ALC_VAL. For
 *  other values of ALC_ID_FIELD,
 *  this value is undefined.
 */
#define TWAIFD_ALC_BIT    0x0000001FU
#define TWAIFD_ALC_BIT_M  (TWAIFD_ALC_BIT_V << TWAIFD_ALC_BIT_S)
#define TWAIFD_ALC_BIT_V  0x0000001FU
#define TWAIFD_ALC_BIT_S  16
/** TWAIFD_ALC_ID_FIELD : RO; bitpos: [23:21]; default: 0;
 *  Part of CAN Identifier in which arbitration was lost.
 *  0b000 - ALC_RSVD - Unit did not loose arbitration since last reset.
 *  0b001 - ALC_BASE_ID - Arbitration was lost during base identifier.
 *  0b010 - ALC_SRR_RTR - Arbitration was lost during first bit after base identifier
 *  (SRR of Extended Frame, RTR
 *  bit of CAN 2.0 Base Frame)
 *  0b011 - ALC_IDE - Arbitration was lost during IDE bit.
 *  0b100 - ALC_EXTENSION - Arbitration was lost during Identifier extension.
 *  0b101 - ALC_RTR - Arbitration was lost during RTR bit after Identifier extension!
 */
#define TWAIFD_ALC_ID_FIELD    0x00000007U
#define TWAIFD_ALC_ID_FIELD_M  (TWAIFD_ALC_ID_FIELD_V << TWAIFD_ALC_ID_FIELD_S)
#define TWAIFD_ALC_ID_FIELD_V  0x00000007U
#define TWAIFD_ALC_ID_FIELD_S  21
/** TWAIFD_TS_BITS : RO; bitpos: [29:24]; default: 0;
 *  Number of active bits of CAN FD time-base minus 1 (0x3F = 64 bit time-base).
 */
#define TWAIFD_TS_BITS    0x0000003FU
#define TWAIFD_TS_BITS_M  (TWAIFD_TS_BITS_V << TWAIFD_TS_BITS_S)
#define TWAIFD_TS_BITS_V  0x0000003FU
#define TWAIFD_TS_BITS_S  24

/** TWAIFD_TRV_DELAY_SSP_CFG_REG register
 *  TWAI FD transmit delay & secondary sample point configuration register
 */
#define TWAIFD_TRV_DELAY_SSP_CFG_REG (DR_REG_TWAIFD_BASE + 0x80)
/** TWAIFD_TRV_DELAY_VALUE : RO; bitpos: [6:0]; default: 0;
 *  Measured Transmitter delay in multiple of minimal Time quanta.
 */
#define TWAIFD_TRV_DELAY_VALUE    0x0000007FU
#define TWAIFD_TRV_DELAY_VALUE_M  (TWAIFD_TRV_DELAY_VALUE_V << TWAIFD_TRV_DELAY_VALUE_S)
#define TWAIFD_TRV_DELAY_VALUE_V  0x0000007FU
#define TWAIFD_TRV_DELAY_VALUE_S  0
/** TWAIFD_SSP_OFFSET : R/W; bitpos: [23:16]; default: 10;
 *  Secondary sampling point offset. Value is given as multiple of minimal Time quanta.
 */
#define TWAIFD_SSP_OFFSET    0x000000FFU
#define TWAIFD_SSP_OFFSET_M  (TWAIFD_SSP_OFFSET_V << TWAIFD_SSP_OFFSET_S)
#define TWAIFD_SSP_OFFSET_V  0x000000FFU
#define TWAIFD_SSP_OFFSET_S  16
/** TWAIFD_SSP_SRC : R/W; bitpos: [25:24]; default: 0;
 *  Source of Secondary sampling point.
 *  0b00 - SSP_SRC_MEAS_N_OFFSET - SSP position = TRV_DELAY (Measured Transmitter
 *  delay) + SSP_OFFSET.
 *  0b01 - SSP_SRC_NO_SSP - SSP is not used. Transmitter uses regular Sampling Point
 *  during data bit rate.
 *  0b10 - SSP_SRC_OFFSET - SSP position = SSP_OFFSET. Measured Transmitter delay value
 *  is ignored.
 */
#define TWAIFD_SSP_SRC    0x00000003U
#define TWAIFD_SSP_SRC_M  (TWAIFD_SSP_SRC_V << TWAIFD_SSP_SRC_S)
#define TWAIFD_SSP_SRC_V  0x00000003U
#define TWAIFD_SSP_SRC_S  24

/** TWAIFD_RX_FR_CTR_REG register
 *  TWAI FD received frame counter register
 */
#define TWAIFD_RX_FR_CTR_REG (DR_REG_TWAIFD_BASE + 0x84)
/** TWAIFD_RX_FR_CTR_VAL : RO; bitpos: [31:0]; default: 0;
 *  Number of received frames by CAN FD.
 */
#define TWAIFD_RX_FR_CTR_VAL    0xFFFFFFFFU
#define TWAIFD_RX_FR_CTR_VAL_M  (TWAIFD_RX_FR_CTR_VAL_V << TWAIFD_RX_FR_CTR_VAL_S)
#define TWAIFD_RX_FR_CTR_VAL_V  0xFFFFFFFFU
#define TWAIFD_RX_FR_CTR_VAL_S  0

/** TWAIFD_TX_FR_CTR_REG register
 *  TWAI FD transmitted frame counter register
 */
#define TWAIFD_TX_FR_CTR_REG (DR_REG_TWAIFD_BASE + 0x88)
/** TWAIFD_TX_CTR_VAL : RO; bitpos: [31:0]; default: 0;
 *  Number of transmitted frames by CAN FD.
 */
#define TWAIFD_TX_CTR_VAL    0xFFFFFFFFU
#define TWAIFD_TX_CTR_VAL_M  (TWAIFD_TX_CTR_VAL_V << TWAIFD_TX_CTR_VAL_S)
#define TWAIFD_TX_CTR_VAL_V  0xFFFFFFFFU
#define TWAIFD_TX_CTR_VAL_S  0

/** TWAIFD_DEBUG_REG register
 *  TWAI FD debug register
 */
#define TWAIFD_DEBUG_REG (DR_REG_TWAIFD_BASE + 0x8c)
/** TWAIFD_STUFF_COUNT : RO; bitpos: [2:0]; default: 0;
 *  Actual stuff count modulo 8 as defined in ISO FD protocol. Stuff count is erased
 *  in the beginning
 *  of CAN frame and increased by one with each stuff bit until Stuff count field in
 *  ISO FD frame. Then it stays fixed
 *  until the beginning of next frame. In non-ISO FD or normal CAN stuff bits are
 *  counted until the end of a frame.
 *  Note that this field is NOT gray encoded as defined in ISO FD standard. Stuff count
 *  is calculated only as long as
 *  controller is transceiving on the bus. During the reception this value remains
 *  fixed!
 */
#define TWAIFD_STUFF_COUNT    0x00000007U
#define TWAIFD_STUFF_COUNT_M  (TWAIFD_STUFF_COUNT_V << TWAIFD_STUFF_COUNT_S)
#define TWAIFD_STUFF_COUNT_V  0x00000007U
#define TWAIFD_STUFF_COUNT_S  0
/** TWAIFD_DESTUFF_COUNT : RO; bitpos: [5:3]; default: 0;
 *  Actual de-stuff count modulo 8 as defined in ISO FD protocol. De-Stuff count is
 *  erased in the
 *  beginning of the frame and increased by one with each de-stuffed bit until Stuff
 *  count field in ISO FD Frame. Then
 *  it stays fixed until beginning of next frame. In non-ISO FD or normal CAN de-stuff
 *  bits are counted until the end
 *  of the frame. Note that this field is NOT grey encoded as defined in ISO FD
 *  standard. De-stuff count is calculated
 *  in both. Transceiver as well as receiver.
 */
#define TWAIFD_DESTUFF_COUNT    0x00000007U
#define TWAIFD_DESTUFF_COUNT_M  (TWAIFD_DESTUFF_COUNT_V << TWAIFD_DESTUFF_COUNT_S)
#define TWAIFD_DESTUFF_COUNT_V  0x00000007U
#define TWAIFD_DESTUFF_COUNT_S  3
/** TWAIFD_PC_ARB : RO; bitpos: [6]; default: 0;
 *  Protocol control state machine is in Arbitration field.
 */
#define TWAIFD_PC_ARB    (BIT(6))
#define TWAIFD_PC_ARB_M  (TWAIFD_PC_ARB_V << TWAIFD_PC_ARB_S)
#define TWAIFD_PC_ARB_V  0x00000001U
#define TWAIFD_PC_ARB_S  6
/** TWAIFD_PC_CON : RO; bitpos: [7]; default: 0;
 *  Protocol control state machine is in Control field.
 */
#define TWAIFD_PC_CON    (BIT(7))
#define TWAIFD_PC_CON_M  (TWAIFD_PC_CON_V << TWAIFD_PC_CON_S)
#define TWAIFD_PC_CON_V  0x00000001U
#define TWAIFD_PC_CON_S  7
/** TWAIFD_PC_DAT : RO; bitpos: [8]; default: 0;
 *  Protocol control state machine is in Data field.
 */
#define TWAIFD_PC_DAT    (BIT(8))
#define TWAIFD_PC_DAT_M  (TWAIFD_PC_DAT_V << TWAIFD_PC_DAT_S)
#define TWAIFD_PC_DAT_V  0x00000001U
#define TWAIFD_PC_DAT_S  8
/** TWAIFD_PC_STC : RO; bitpos: [9]; default: 0;
 *  Protocol control state machine is in Stuff Count field.
 */
#define TWAIFD_PC_STC    (BIT(9))
#define TWAIFD_PC_STC_M  (TWAIFD_PC_STC_V << TWAIFD_PC_STC_S)
#define TWAIFD_PC_STC_V  0x00000001U
#define TWAIFD_PC_STC_S  9
/** TWAIFD_PC_CRC : RO; bitpos: [10]; default: 0;
 *  Protocol control state machine is in CRC field.
 */
#define TWAIFD_PC_CRC    (BIT(10))
#define TWAIFD_PC_CRC_M  (TWAIFD_PC_CRC_V << TWAIFD_PC_CRC_S)
#define TWAIFD_PC_CRC_V  0x00000001U
#define TWAIFD_PC_CRC_S  10
/** TWAIFD_PC_CRCD : RO; bitpos: [11]; default: 0;
 *  Protocol control state machine is in CRC Delimiter field.
 */
#define TWAIFD_PC_CRCD    (BIT(11))
#define TWAIFD_PC_CRCD_M  (TWAIFD_PC_CRCD_V << TWAIFD_PC_CRCD_S)
#define TWAIFD_PC_CRCD_V  0x00000001U
#define TWAIFD_PC_CRCD_S  11
/** TWAIFD_PC_ACK : RO; bitpos: [12]; default: 0;
 *  Protocol control state machine is in ACK field.
 */
#define TWAIFD_PC_ACK    (BIT(12))
#define TWAIFD_PC_ACK_M  (TWAIFD_PC_ACK_V << TWAIFD_PC_ACK_S)
#define TWAIFD_PC_ACK_V  0x00000001U
#define TWAIFD_PC_ACK_S  12
/** TWAIFD_PC_ACKD : RO; bitpos: [13]; default: 0;
 *  Protocol control state machine is in ACK Delimiter field.
 */
#define TWAIFD_PC_ACKD    (BIT(13))
#define TWAIFD_PC_ACKD_M  (TWAIFD_PC_ACKD_V << TWAIFD_PC_ACKD_S)
#define TWAIFD_PC_ACKD_V  0x00000001U
#define TWAIFD_PC_ACKD_S  13
/** TWAIFD_PC_EOF : RO; bitpos: [14]; default: 0;
 *  Protocol control state machine is in End of file field.
 */
#define TWAIFD_PC_EOF    (BIT(14))
#define TWAIFD_PC_EOF_M  (TWAIFD_PC_EOF_V << TWAIFD_PC_EOF_S)
#define TWAIFD_PC_EOF_V  0x00000001U
#define TWAIFD_PC_EOF_S  14
/** TWAIFD_PC_INT : RO; bitpos: [15]; default: 0;
 *  Protocol control state machine is in Intermission field.
 */
#define TWAIFD_PC_INT    (BIT(15))
#define TWAIFD_PC_INT_M  (TWAIFD_PC_INT_V << TWAIFD_PC_INT_S)
#define TWAIFD_PC_INT_V  0x00000001U
#define TWAIFD_PC_INT_S  15
/** TWAIFD_PC_SUSP : RO; bitpos: [16]; default: 0;
 *  Protocol control state machine is in Suspend transmission field.
 */
#define TWAIFD_PC_SUSP    (BIT(16))
#define TWAIFD_PC_SUSP_M  (TWAIFD_PC_SUSP_V << TWAIFD_PC_SUSP_S)
#define TWAIFD_PC_SUSP_V  0x00000001U
#define TWAIFD_PC_SUSP_S  16
/** TWAIFD_PC_OVR : RO; bitpos: [17]; default: 0;
 *  Protocol control state machine is in Overload field.
 */
#define TWAIFD_PC_OVR    (BIT(17))
#define TWAIFD_PC_OVR_M  (TWAIFD_PC_OVR_V << TWAIFD_PC_OVR_S)
#define TWAIFD_PC_OVR_V  0x00000001U
#define TWAIFD_PC_OVR_S  17
/** TWAIFD_PC_SOF : RO; bitpos: [18]; default: 0;
 *  Protocol control state machine is in Start of frame field.
 */
#define TWAIFD_PC_SOF    (BIT(18))
#define TWAIFD_PC_SOF_M  (TWAIFD_PC_SOF_V << TWAIFD_PC_SOF_S)
#define TWAIFD_PC_SOF_V  0x00000001U
#define TWAIFD_PC_SOF_S  18

/** TWAIFD_YOLO_REG register
 *  TWAI FD transmitted frame counter register
 */
#define TWAIFD_YOLO_REG (DR_REG_TWAIFD_BASE + 0x90)
/** TWAIFD_YOLO_VAL : RO; bitpos: [31:0]; default: 3735928559;
 *  What else could be in this register??
 */
#define TWAIFD_YOLO_VAL    0xFFFFFFFFU
#define TWAIFD_YOLO_VAL_M  (TWAIFD_YOLO_VAL_V << TWAIFD_YOLO_VAL_S)
#define TWAIFD_YOLO_VAL_V  0xFFFFFFFFU
#define TWAIFD_YOLO_VAL_S  0

/** TWAIFD_TIMESTAMP_LOW_REG register
 *  TWAI FD transmitted frame counter register
 */
#define TWAIFD_TIMESTAMP_LOW_REG (DR_REG_TWAIFD_BASE + 0x94)
/** TWAIFD_TIMESTAMP_LOW : RO; bitpos: [31:0]; default: 0;
 *  Bits 31:0 of time base.
 */
#define TWAIFD_TIMESTAMP_LOW    0xFFFFFFFFU
#define TWAIFD_TIMESTAMP_LOW_M  (TWAIFD_TIMESTAMP_LOW_V << TWAIFD_TIMESTAMP_LOW_S)
#define TWAIFD_TIMESTAMP_LOW_V  0xFFFFFFFFU
#define TWAIFD_TIMESTAMP_LOW_S  0

/** TWAIFD_TIMESTAMP_HIGH_REG register
 *  TWAI FD transmitted frame counter register
 */
#define TWAIFD_TIMESTAMP_HIGH_REG (DR_REG_TWAIFD_BASE + 0x98)
/** TWAIFD_TIMESTAMP_HIGH : RO; bitpos: [31:0]; default: 0;
 *  Bits 63:32 of time base.
 */
#define TWAIFD_TIMESTAMP_HIGH    0xFFFFFFFFU
#define TWAIFD_TIMESTAMP_HIGH_M  (TWAIFD_TIMESTAMP_HIGH_V << TWAIFD_TIMESTAMP_HIGH_S)
#define TWAIFD_TIMESTAMP_HIGH_V  0xFFFFFFFFU
#define TWAIFD_TIMESTAMP_HIGH_S  0

/** TWAIFD_TIMER_CLK_EN_REG register
 *  TWAIFD timer clock force enable register.
 */
#define TWAIFD_TIMER_CLK_EN_REG (DR_REG_TWAIFD_BASE + 0xfd4)
/** TWAIFD_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set this bit to force enable TWAIFD register configuration clock signal.
 */
#define TWAIFD_CLK_EN    (BIT(0))
#define TWAIFD_CLK_EN_M  (TWAIFD_CLK_EN_V << TWAIFD_CLK_EN_S)
#define TWAIFD_CLK_EN_V  0x00000001U
#define TWAIFD_CLK_EN_S  0
/** TWAIFD_FORCE_RXBUF_MEM_CLK_ON : R/W; bitpos: [1]; default: 0;
 *  Set this bit to force enable TWAIFD RX buffer ram clock signal.
 */
#define TWAIFD_FORCE_RXBUF_MEM_CLK_ON    (BIT(1))
#define TWAIFD_FORCE_RXBUF_MEM_CLK_ON_M  (TWAIFD_FORCE_RXBUF_MEM_CLK_ON_V << TWAIFD_FORCE_RXBUF_MEM_CLK_ON_S)
#define TWAIFD_FORCE_RXBUF_MEM_CLK_ON_V  0x00000001U
#define TWAIFD_FORCE_RXBUF_MEM_CLK_ON_S  1

/** TWAIFD_TIMER_INT_RAW_REG register
 *  TWAIFD raw interrupt register.
 */
#define TWAIFD_TIMER_INT_RAW_REG (DR_REG_TWAIFD_BASE + 0xfd8)
/** TWAIFD_TIMER_OVERFLOW_INT_RAW : R/SS/WTC; bitpos: [0]; default: 0;
 *  The raw bit signal for read_done interrupt.
 */
#define TWAIFD_TIMER_OVERFLOW_INT_RAW    (BIT(0))
#define TWAIFD_TIMER_OVERFLOW_INT_RAW_M  (TWAIFD_TIMER_OVERFLOW_INT_RAW_V << TWAIFD_TIMER_OVERFLOW_INT_RAW_S)
#define TWAIFD_TIMER_OVERFLOW_INT_RAW_V  0x00000001U
#define TWAIFD_TIMER_OVERFLOW_INT_RAW_S  0

/** TWAIFD_TIMER_INT_ST_REG register
 *  TWAIFD interrupt status register.
 */
#define TWAIFD_TIMER_INT_ST_REG (DR_REG_TWAIFD_BASE + 0xfdc)
/** TWAIFD_TIMER_OVERFLOW_INT_ST : RO; bitpos: [0]; default: 0;
 *  The status signal for read_done interrupt.
 */
#define TWAIFD_TIMER_OVERFLOW_INT_ST    (BIT(0))
#define TWAIFD_TIMER_OVERFLOW_INT_ST_M  (TWAIFD_TIMER_OVERFLOW_INT_ST_V << TWAIFD_TIMER_OVERFLOW_INT_ST_S)
#define TWAIFD_TIMER_OVERFLOW_INT_ST_V  0x00000001U
#define TWAIFD_TIMER_OVERFLOW_INT_ST_S  0

/** TWAIFD_TIMER_INT_ENA_REG register
 *  TWAIFD interrupt enable register.
 */
#define TWAIFD_TIMER_INT_ENA_REG (DR_REG_TWAIFD_BASE + 0xfe0)
/** TWAIFD_TIMER_OVERFLOW_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The enable signal for read_done interrupt.
 */
#define TWAIFD_TIMER_OVERFLOW_INT_ENA    (BIT(0))
#define TWAIFD_TIMER_OVERFLOW_INT_ENA_M  (TWAIFD_TIMER_OVERFLOW_INT_ENA_V << TWAIFD_TIMER_OVERFLOW_INT_ENA_S)
#define TWAIFD_TIMER_OVERFLOW_INT_ENA_V  0x00000001U
#define TWAIFD_TIMER_OVERFLOW_INT_ENA_S  0

