espressif/esp-idf/components/soc/esp32h4/register/soc/twaifd_reg.h
/** TWAIFD_TIMER_INT_CLR_REG register
 *  TWAIFD interrupt clear register.
 */
#define TWAIFD_TIMER_INT_CLR_REG (DR_REG_TWAIFD_BASE + 0xfe4)
/** TWAIFD_TIMER_OVERFLOW_INT_CLR : WT; bitpos: [0]; default: 0;
 *  The clear signal for read_done interrupt.
 */
#define TWAIFD_TIMER_OVERFLOW_INT_CLR    (BIT(0))
#define TWAIFD_TIMER_OVERFLOW_INT_CLR_M  (TWAIFD_TIMER_OVERFLOW_INT_CLR_V << TWAIFD_TIMER_OVERFLOW_INT_CLR_S)
#define TWAIFD_TIMER_OVERFLOW_INT_CLR_V  0x00000001U
#define TWAIFD_TIMER_OVERFLOW_INT_CLR_S  0

/** TWAIFD_TIMER_CFG_REG register
 *  TWAI FD timer configure register.
 */
#define TWAIFD_TIMER_CFG_REG (DR_REG_TWAIFD_BASE + 0xfe8)
/** TWAIFD_TIMER_CE : R/W; bitpos: [0]; default: 0;
 *  TWAI FD timer enable register.
 *  1b0: Not enable
 *  1b1: Enable timer
 */
#define TWAIFD_TIMER_CE    (BIT(0))
#define TWAIFD_TIMER_CE_M  (TWAIFD_TIMER_CE_V << TWAIFD_TIMER_CE_S)
#define TWAIFD_TIMER_CE_V  0x00000001U
#define TWAIFD_TIMER_CE_S  0
/** TWAIFD_TIMER_CLR : WT; bitpos: [1]; default: 0;
 *  TWAI FD timer clear register.
 *  1b0: Not enable
 *  1b1: Enable to clear value
 */
#define TWAIFD_TIMER_CLR    (BIT(1))
#define TWAIFD_TIMER_CLR_M  (TWAIFD_TIMER_CLR_V << TWAIFD_TIMER_CLR_S)
#define TWAIFD_TIMER_CLR_V  0x00000001U
#define TWAIFD_TIMER_CLR_S  1
/** TWAIFD_TIMER_SET : WT; bitpos: [2]; default: 0;
 *  TWAI FD timer set register.
 *  1b0: Not enable
 *  1b1: Enable to set value to ld_val.
 */
#define TWAIFD_TIMER_SET    (BIT(2))
#define TWAIFD_TIMER_SET_M  (TWAIFD_TIMER_SET_V << TWAIFD_TIMER_SET_S)
#define TWAIFD_TIMER_SET_V  0x00000001U
#define TWAIFD_TIMER_SET_S  2
/** TWAIFD_TIMER_UP_DN : R/W; bitpos: [8]; default: 1;
 *  TWAI FD timer up/down count register.
 *  1b0: Count-down
 *  1b1: Count-up
 */
#define TWAIFD_TIMER_UP_DN    (BIT(8))
#define TWAIFD_TIMER_UP_DN_M  (TWAIFD_TIMER_UP_DN_V << TWAIFD_TIMER_UP_DN_S)
#define TWAIFD_TIMER_UP_DN_V  0x00000001U
#define TWAIFD_TIMER_UP_DN_S  8
/** TWAIFD_TIMER_STEP : R/W; bitpos: [31:16]; default: 0;
 *  TWAI FD timer count step register, step=reg_timer_step+1
 */
#define TWAIFD_TIMER_STEP    0x0000FFFFU
#define TWAIFD_TIMER_STEP_M  (TWAIFD_TIMER_STEP_V << TWAIFD_TIMER_STEP_S)
#define TWAIFD_TIMER_STEP_V  0x0000FFFFU
#define TWAIFD_TIMER_STEP_S  16

/** TWAIFD_TIMER_LD_VAL_L_REG register
 *  TWAI FD timer pre-load value low register.
 */
#define TWAIFD_TIMER_LD_VAL_L_REG (DR_REG_TWAIFD_BASE + 0xfec)
/** TWAIFD_TIMER_LD_VAL_L : R/W; bitpos: [31:0]; default: 0;
 *  TWAI FD timer count pre-load value register, low part.
 */
#define TWAIFD_TIMER_LD_VAL_L    0xFFFFFFFFU
#define TWAIFD_TIMER_LD_VAL_L_M  (TWAIFD_TIMER_LD_VAL_L_V << TWAIFD_TIMER_LD_VAL_L_S)
#define TWAIFD_TIMER_LD_VAL_L_V  0xFFFFFFFFU
#define TWAIFD_TIMER_LD_VAL_L_S  0

/** TWAIFD_TIMER_LD_VAL_H_REG register
 *  TWAI FD timer pre-load value high register.
 */
#define TWAIFD_TIMER_LD_VAL_H_REG (DR_REG_TWAIFD_BASE + 0xff0)
/** TWAIFD_TIMER_LD_VAL_H : R/W; bitpos: [31:0]; default: 0;
 *  TWAI FD timer pre-load value register, high part.
 *  If timestamp valid bit-width less than 33, this field is ignored.
 */
#define TWAIFD_TIMER_LD_VAL_H    0xFFFFFFFFU
#define TWAIFD_TIMER_LD_VAL_H_M  (TWAIFD_TIMER_LD_VAL_H_V << TWAIFD_TIMER_LD_VAL_H_S)
#define TWAIFD_TIMER_LD_VAL_H_V  0xFFFFFFFFU
#define TWAIFD_TIMER_LD_VAL_H_S  0

/** TWAIFD_TIMER_CT_VAL_L_REG register
 *  TWAI FD timer count-to value low register.
 */
#define TWAIFD_TIMER_CT_VAL_L_REG (DR_REG_TWAIFD_BASE + 0xff4)
/** TWAIFD_TIMER_CT_VAL_L : R/W; bitpos: [31:0]; default: 4294967295;
 *  TWAI FD timer count-to value register, low part.
 */
#define TWAIFD_TIMER_CT_VAL_L    0xFFFFFFFFU
#define TWAIFD_TIMER_CT_VAL_L_M  (TWAIFD_TIMER_CT_VAL_L_V << TWAIFD_TIMER_CT_VAL_L_S)
#define TWAIFD_TIMER_CT_VAL_L_V  0xFFFFFFFFU
#define TWAIFD_TIMER_CT_VAL_L_S  0

/** TWAIFD_TIMER_CT_VAL_H_REG register
 *  TWAI FD timer count-to value high register.
 */
#define TWAIFD_TIMER_CT_VAL_H_REG (DR_REG_TWAIFD_BASE + 0xff8)
/** TWAIFD_TIMER_CT_VAL_H : R/W; bitpos: [31:0]; default: 4294967295;
 *  TWAI FD timer count-to value register, high part.
 *  If timestamp valid bit-width less than 33, this field is ignored.
 */
#define TWAIFD_TIMER_CT_VAL_H    0xFFFFFFFFU
#define TWAIFD_TIMER_CT_VAL_H_M  (TWAIFD_TIMER_CT_VAL_H_V << TWAIFD_TIMER_CT_VAL_H_S)
#define TWAIFD_TIMER_CT_VAL_H_V  0xFFFFFFFFU
#define TWAIFD_TIMER_CT_VAL_H_S  0

/** TWAIFD_DATE_VER_REG register
 *  TWAI FD date version
 */
#define TWAIFD_DATE_VER_REG (DR_REG_TWAIFD_BASE + 0xffc)
/** TWAIFD_DATE_VER : R/W; bitpos: [31:0]; default: 36774224;
 *  TWAI FD version
 */
#define TWAIFD_DATE_VER    0xFFFFFFFFU
#define TWAIFD_DATE_VER_M  (TWAIFD_DATE_VER_V << TWAIFD_DATE_VER_S)
#define TWAIFD_DATE_VER_V  0xFFFFFFFFU
#define TWAIFD_DATE_VER_S  0

#ifdef __cplusplus
}
#endif
